import mock from '@/@fake-db/mock'
const data = {
    blogs: [{
            id: 1,
            fullName: 'علی اسماعیلی',
            job: 'بازاریاب',
            content: 'انسان تا وقتی فکر میکند نارس است ، به رشد و کمال خود ادامه می‌دهد و به محض آنکه گمان کرد رسیده شده است دچار آفت می‌شود',
        },
        {
            id: 2,
            fullName: 'کیمیا شیرعلی',
            job: 'توسعه دهنده',
            content: 'من دنیای پر از شیر و عسل را دوست نمی‌دارم، من دنیای کوچک و گرمی را دوست دارم که خودم با دست خود آن را ساخته باشم.',
        },
        {
            id: 3,
            fullName: 'فاطمه حیدری',
            job: 'گرافیست',
            content: 'زمانی که راهی را شروع می کنی همواره به پایان ان بیندیش و زمانی که ان را به پایان رساندی نقطه ی آغاز رافراموش مکن . یادت باشد که ازصفرامدی و یادت بماند که به صد می رسی',
        },
        {
            id: 4,
            fullName: 'حمید رضایی',
            job: 'مدرس شیمی',
            content: 'اگر کودک همان نخستین بار که به زمین می خورداز راه افتادن دست می کشیدهرگز به راه نمی افتاد',
        },
        {
            id: 5,
            fullName: 'نداکریمی',
            job: 'عکاس',
            content: 'بااعتمادبه نفس انتظار وقوع چیزی راداشته باشید تادرجهان پیرامونتان امکان وقوع پیدا کند',
        },
        {
            id: 6,
            fullName: 'مهدی ناصری',
            job: 'توسعه دهنده',
            content: 'هیچ وقت برای چیزی که قدرت به دست اوردنش را دارید گدایی نکنید',
        },
    ]
}
mock.onGet('/blogslider').reply(config => {
    return [
        200,
        data.blogs
    ]
})