import mock from '@/@fake-db/mock'
const data = {
    eBooks: [{
            id: 50,
            name: 'آن شرلی با موهای قرمز',
            englishName: 'ane shrly with red hair',
            image: 'https://img.taaghche.com/audioCover/35274.jpg',
            price: {
                amount: 15000,
                discount_amount: 2000,
                discount_percentage: 4,
                final_amount: 13000,
            },
            bookInfo: [{
                    title: ' حجم',
                    value: '8.5 مگابایت',
                    icon: 'mdi-arrow-down-circle-outline',
                },
                {
                    title: 'تیراژ',
                    value: 2000,
                    icon: 'mdi-google-analytics',
                },
                {
                    title: ' نوع فایل',
                    value: 'PDF',
                    icon: 'mdi-file-document-outline',
                },
                {
                    title: 'شابک',
                    value: 9786009495535,
                    icon: 'mdi-barcode',
                },
                {
                    title: ' زبان',
                    value: 'فارسی',
                    icon: 'mdi-translate',
                },
                {
                    title: ' تعداد صفحات',
                    value: 159,
                    icon: 'mdi-format-list-bulleted',
                },
                {
                    title: 'سال چاپ',
                    value: 1399,
                    icon: 'mdi-calendar-month-outline',
                },
                {
                    title: 'نویسنده',
                    value: ' لوسی ماد مونتگمری',
                    icon: 'mdi-account',
                },
            ],
            detail: {
                description: '<p>آن شرلی دختر بچه ای ۱۱ ساله است که در زمان نوزادی، والدینش را از دست داده و پس از آن زندگی پرماجرایی در نوانخانه ها و خانه های پرجمعیت داشته است. زندگی دخترک در نوانخانه ادامه داشت تا این که به او خبر می دهند که خواهر و برادری میانسال، او را به فرزند خواندگی خود پذیرفته اند. حال دیگر آنی شرلی باید وسایل ناچیز خود را جمع کرده و به گرین گیبلز، نزد «ماریلا» و «متیو کاتبرت» برود. آن شرلی با ذوق و شوق کودکانه خود به گرین گیبلز می رود و در کمال ناباوری متوجه می شود که ماریلا و ماتیو کاتبرت قصد داشتند پسر بچه ای را به فرزندی خود بپذیرند و در این بین اشتباهی صورت گرفته است. به همین دلیل آن شرلی باید دوباره به نوانخانه غمزده بازگردد و</p> <h3>خلاصه کتاب</h3> <p> سال‌ها پیش دهکده کوچکی به نام آونلی وجود داشت.در این دهکده برادر و خواهری به نام متیو و ماریلا زندگی می‌کردند.آن‌ها پیر شده بودند و انگیزه‌ای برای زندگی نداشتند.به همین خاطر آن‌ها تصمیم گرفتند از پرورشگاه پسری را به فرزندی قبول کنند تا در کارهای مزرعه به آن‌ها کمک کند.اما روزی که متیو به ایستگاه قطار رفت تا پسرک مورد نظر را به خانه ببرد، با تعجب دید دختر بچه‌ای کوچک با صورت کَ ک و مَ کی و موهای قرمز منتظرش است.متیو که منتظر دیدن پسر بچه‌ای بود، متعجب شد، اما نمی‌توانست دختر بچه را همان‌جا رها کند.برای همین او را با خود به خانه برد.آن شرلی دختری پر حرف بود و از این که قرار بود صاحب خانه و خانواده‌ای شود سر از پا نمی‌شناخت.اما بعد از رسیدن آن‌ها به خانه، ماریلا نیز از دیدن دختر متعجب و ناراحت شد.آنشرلی از برخورد آن دو فهمید که آن‌ها منتظر بچه‌ای پسر بودند تا در کارها کمکشان کند و شادی‌اش به سرعت به غمی سهمگین مبدل شد، ولی ماریلا که وضعیت را این‌چنین دید، تصمیم گرفت تا سرپرستی این دختر دوست داشتنی را بر عهده بگیرد. </p><h3>بخشی از متن کتاب</h3><p>او تقریبا پنج ثانیه زبانش بند آمد. قابل تصور نبود که ماريلا با او شوخی کرده باشد، اما خانم ریچل به زور می خواست به خود بقبولاند که آن یک شوخی است. بالاخره وقتی صدایش دوباره به حالت طبیعی درآمد، گفت: جدی می گویی، ماریلا؟!» ماریلا گفت: « بله، البته » او با ناباوری و به نشانه مخالفت گفت: « آخر چطور چنین فکری به سرتان زد؟» ماری جواب داد: « خوب، ما خیلی وقت است که داریم به این موضوع فکر میکنیم، تقریبا از ابتدای زمستان. خانم الكساندر اسپنسر یک روز قبل از کریسمس به اینجا آمد و گفت که قصد دارد فصل بهار یک دختر کوچولو را از یتیم خانه ای در هوپتاون قبول کند.</p> <p>دخترعمویش آن جا زندگی می کند و خانم اسپنسر بعد از ملاقات با او درباره این مسئله اطلاعات کاملی کسب کرده بود. به این ترتیب این قضیه ذهن من و متیو را هم به خودش مشغول کرد. ما فکر می کردیم یک پسر قبول کنیم. میدانی سن متیو بالا رفته. او تقریبا شصت سال دارد و دیگر به چالاکی گذشته نیست. قلبش هم برایش مشکل ساز شده است. حتما خودت میدانی که این روزها پیدا کردن یک کارگر خوب چقدر سخت است. به جز پسربچه های خام و نابالغ فرانسوی کسی حاضر به این کار نمی شود که آنها هم تا سرت را بر می گردانی یا به فکر فرو می روی، غیبشان میزند.</p><p>شما نمی فهمید چه کار می کنید شما می خواهید یک بچه غریبه را به خانه تان راه بدهید، در حالی که نه میدانید او چطور بچه ایست، نه میدانید پدر و مادرش چه طور آدم هایی بوده اند و نه معلوم است چه طور بار بیاید. هفته ی پیش در روزنامه خواندم زن و شوهری از اهالی غرب جزیره پسری را از یک یتیم خانه به فرزندی قبول کرده بودند، آن بچه یک شب خانه را به آتش می کشد و نزدیک بوده زن و شوهر در رخت خوابشان جزغاله شوند، متوجه ای ماريلا؟! یک مورد دیگر هم شنیدم که پسری از یتیم خانه آمده بوده، عادت به دزدیدن تخم مرغ ها داشته و پدرخوانده و مادر خوانده اش نتوانستند این عادت او را ترک بدهند.</p>',

                avgRating: 2,
                ratingHistogram: [
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                ],
                reviewInfo: [{
                        title: 'تعداد دیدگاه : ',
                        amount: 2,
                    },
                    {
                        title: 'امتیاز کلی :',
                        amount: 10,
                    },
                    {
                        title: 'پیشنهاد شده توسط :  ',
                        amount: '2کاربر',
                    },
                ],
                comments: [{
                        fullName: 'نازنین',
                        publishedDate: '25 مهر 1399',
                        courseIdea: [
                            { amount: 4, title: 'موافقم' },
                            { amount: 1, title: 'مخالفم' },
                        ],
                        content: 'سلام خسته نباشید، بسیارعالی بود',
                    },
                    {
                        fullName: 'سیما',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 8, title: 'موافقم' },
                            { amount: 2, title: 'مخالفم' },
                        ],
                        content: 'سپاس فراوان از زحمات شما',
                    },
                ],
                tabs: [{
                        tab: 'توضیحات',
                        icon: 'mdi-sticker-text-outline',
                    },
                    { tab: 'نظرات', icon: 'mdi-comment-text-outline' },
                ],
            },
            emogyRate: {
                emojes: [
                    { name: 'mdi-emoticon-sad-outline', color: 'grey' },
                    { name: 'mdi-emoticon-confused-outline', color: 'grey' },
                    { name: 'mdi-emoticon-neutral-outline', color: 'grey' },
                    { name: 'mdi-emoticon-happy-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                ],
                rate: { vote: 2, score: 10 },
            },
            benefits: [
                { title: 'دسترسی به فایل محصول به صورت مادام‌العمر' },
                { title: 'تضمین کیفیت آموزش ها' },
                { title: 'فعال‌سازی آنی لینک دانلود، پس از ثبت سفارش' },
                { title: 'فروش فقط از طریق دیجی آکادمی' },
                { title: 'به صورت رایگان یک یا چند آموزش را دریافت می کنید.' },
            ],
            authore: {
                caption: 'فروشنده',
                fullName: 'زینب نادری',
                content: 'زمان خود را به بهتر کردن خود با مطالعه نوشته های دیگران اختصاص دهید. بنابراین شما به سادگی آنچه را بدست می آورید که دیگران سخت برای آن زحمت کشیده اند.',
            },
            btnCategory: [{ title: 'کتاب الکترونیکی', id: 9 }],
            breadcrumbs: [{
                    type: 'subject',
                    id: 9,
                    title: 'کتاب الکترونیکی',
                },
                {
                    type: 'product',
                    id: 50,
                    title: 'آن شرلی با موهای قرمز',
                },
            ],
        },
        {
            id: 51,
            name: 'بابالنگ دراز',
            englishName: 'father width long leg',
            image: 'http://omdeketab.ir/wp-content/uploads/2020/07/aa.1.jpg',
            price: {
                amount: 25000,
                discount_amount: 4000,
                discount_percentage: 8,
                final_amount: 21000,
            },
            bookInfo: [{
                    title: ' حجم',
                    value: '15 مگابایت',
                    icon: 'mdi-arrow-down-circle-outline',
                },
                {
                    title: 'تیراژ',
                    value: 3000,
                    icon: 'mdi-google-analytics',
                },
                {
                    title: ' نوع فایل',
                    value: 'PDF',
                    icon: 'mdi-file-document-outline',
                },
                {
                    title: 'شابک',
                    value: 9786009495535,
                    icon: 'mdi-barcode',
                },
                {
                    title: ' زبان',
                    value: 'فارسی',
                    icon: 'mdi-translate',
                },
                {
                    title: ' تعداد صفحات',
                    value: 159,
                    icon: 'mdi-format-list-bulleted',
                },
                {
                    title: 'سال چاپ',
                    value: 1399,
                    icon: 'mdi-calendar-month-outline',
                },
                {
                    title: 'نویسنده',
                    value: 'جین وبستر',
                    icon: 'mdi-account',
                },
            ],
            detail: {
                description: '<h3>بابا لنگ دراز</h3> <p> اثر جین وبستر که یکی از بهترین رمان‌های عاشقانه کلاسیک است را از فردی غریبه و نا‌آشنا دریافت کردم.او بسته‌ای به خانه‌ام فرستاد که حاوی یک کتاب و یک نامه بود.قبل از مطالعه، در نامه نوشته بود: «به نظرم، مورد شگفت‌انگیز در مورد کتاب‌ها این است که آنها می‌توانند در لحظات مختلف زندگی ما، معنای دیگری داشته باشند.این رمان از این دست کتاب‌هاست.این اثر احتمالا بر خلاف آنچه قبلا خوانده‌ای و قطعا از آن کتاب‌هایی نیست را مد روز باشد، ولی به شدت رمانی اسرارآمیز است و بهتر آنکه عمیق بخوانیش. </p> <p> در کتاب تلاش‌های جودی ابوت را به داشتن دوستی‌ها، کوشش‌هایش برای مهارت‌ در نوشتن و اولین تجربه‌اش با عشق را خواهی دید.جین وبستر همه کتاب را در لحنی معصومانه، سرگرم‌کننده و ساده بیان می‌کند.با گذشت زمان، نامه‌های جودی، نشان از تغییرات درونی و اجتماعی او دارد، و اینکه چگونه او به سرعت تبدیل به زنی مستقل می‌شود».پیش از آنکه شروع به خواند کتاب کنم، روح اسرار‌آمیز نامه ذهنم را رها نمی‌کرد.فکر می‌کنم او را قبلا جایی دیدم، زمانی که از در یتیم خانه‌ای که در آن کار می‌کردم مردی گذشت و من سایه بلند قد او را که نور خورشید آن را بیشتر به داخل می‌کشید را دیدم، اما او کیست؟ </p><h3>خلاصه کتاب </h3> <p> جودی ابوت(جروشا ابوت) با آن موهای قرمز بافته شده‌اش، دختر مهربون و یتیم ولی در عین حال شاد و باهوشی است که پدر و مادرش را زمانی که هنوز کودکی بیش نبود، از دست داد.او در خیابان بسون در نیویورک سیتی پیدا و به یتیم خانه جان گیر منتقل شد، جایی که او توانایی خود برای نوشتن را کشف کرد.یکی از مقالات او توجه وکیلی به نام« جان اسمیت» را جلب می‌کند و بدون آنکه جودی او را بشناسد، جان به او اجازه می‌دهد تا تحصیلات خود را برای حضور در دبیرستان یادبود لینکلن ادامه دهد. </p><p>جودی از راه دور نگاهی کوتاه به خیرخواه اسرارآمیز خود به هنگام خروج از یتیم خانه می‌اندازد، سایه کشیده او نشان از مردی قد بلند دارد، او نامش را «بابا لنگ دراز» می‌گذارد. تنها درخواست پدر برای ارائه کمک هزینه تحصیلی این است که جودی یک بار در ماه نامه‌ای برای او بنویسد. اگر چه جودی ابوت می‌داند که هرگز به نامه‌هایش پاسخ نخواهد داد، او بیشتر و بیشتر در مورد این نجیب‌زاده بی‌نظیر و مهربان قدیمی خود کنجکاو می‌شود. همچنین، هم‌کلاسی‌های جودی در دبیرستان عبارتند از: سالی مک‌براید و جولیا پندلتون.</p> <p> ر همین حال، رابطه دیگری را با جرویس پندلتون آغاز می‌کند، عموی یكی از هم اتاقی‌هایش در دبیرستان.از طریق نامه‌های ماهانه جودی به پدر و همچنین نزدیکی او به جرویس، رشد او را از یک دختر یتیم دور افتاده به زنی مستقل نشان می‌دهد.در نهایت، جودی ابوت با مردی که هرگز انتظارش نداشت روبرو شده و متوجه می‌شود که او، همان عشق واقعی او« جرویس پندلتون» است. </p> <h3>شخصیت های اصلی کتاب</h3> <p> جودی آبوت: شخصیت اصلی رمان جین وبستر که در یتیم خانه بزرگ شده و به نوشتن علاقه زیادی دارد.دختری بسیار باهوش، اجتماعی و شاد است و تحت سرپرستی مردی مهربان و در عین حال عجیب قرار دارد.او از نام اصلی‌اش« جروشا» بی‌زار است، ولی عاشق اسم جودی است. </p> <p> سالی مک‌بِ راید: دختر خجالتی ولی شیرینی است، او یکی از هم اتاقی‌های جودی در دبیرستان یادبود لینکلن است.آنها رابطه دوستانه بسیار نزدیکی با یکدیگر دارند.او با وجود قدی کوتاه و بدنی چاق، اراده‌ای قوی دارد. </p> <p> جولیا پندلتون: دانش آموز ثروتمند، خودخواه، قد بلند و زیبا که یکی از هم اتاقی‌های جودی و سالی در دبیرستان است. </p> <p> جوانا اسلون: مدیر خوابگاهی است که جود و هم کلاسی‌هایش در آن زندگی می‌کنند.اغلب از اینکه او را خانم بنامند، تنفر دارد، زیرا هنوز مجرد است. </p> <p> جرویس پندلتون: او عموی جولیاست، ثروتمند و بسیار با شخصیت است، ولی به مادیات اهمیت زیادی نمی‌دهد. </p><p>مری: زن قوی، شوخ طبع و با قدرت عمل بالاست. او ایده بسیار واقع گرایانه برای آموزش یتیم‌ها دارد، به همین دلیل محبوب کودکان است.</p> <p> جیمی مک‌براید: برادر مهربان، محبوب و بزرگ‌تر سالی است و جودی ابوت را دوست دارد. </p> <p> لئونورا فنتون: همسایه جدید جودی که 1 سال بزرگ‌تر از اوست.او به علت بیماری در قفسه سینه یک سال از تحصیل دور بود، به همین علت همکلاسی جودی ابوت شد. </p> <p> کاترین: مدیر یتیم خانه جان گیر است.به علت روحیه سختگیرانه‌ای که داشت، کودکان اغلب از او متنفر بودند. </p><h3>زیباترین نامه بابا لنگ دراز به جودی ابوت</h3> <p> «جودی عزیزم!کاملا با تو موافقم که عده‌ای از مردم هرگز زندگی نمی‌کنند و زندگی را یک مسابقه دو می‌دانند و می‌خواهند هر چه زودتر به هدفی که در افق دور دست است دست یابند و توجه نمی کنند که چقدر خسته شده‌اند که حتی شاید نتوانند به مقصد برسند و اگر هم برسند ناگهان خود را در پایان خط می‌بینند.در حالی‌ که نه به مسیر توجه داشته‌اند و نه لذتی از آن برده‌اند.دیر یا زود آدم پیر و خسته می‌شود در حالی‌که از اطراف خود غافل بوده است.آن وقت دیگر رسیدن به آرزوها و اهداف هم برای بی تفاوت می‌شود و فقط او می‌ماند، خستگی و فرصت و زمانی که ازدست رفته و به دست نخواهد آمد.» </p> <p> «جودی عزیزم!درست است، ما به اندازه خاطرات خوشی که از دیگران داریم آنها را دوست داریم و به آنها وابسته می‌شویم.هر چه خاطرات خوشمان از شخصی بیشتر باشد، علاقه و وابستگی نیز بیشتر می‌شود.پس هر کسی را بیشتر دوست داریم و می‌خواهیم که بیشتر دوستمان بدارد، باید برایش خاطرات خوش زیادی بسازیم تا بتوانیم در دلش ثبت شویم.» </p>',
                avgRating: 1,
                ratingHistogram: [
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                ],
                reviewInfo: [{
                        title: 'تعداد دیدگاه : ',
                        amount: 1,
                    },
                    {
                        title: 'امتیاز کلی :',
                        amount: 5,
                    },
                    {
                        title: 'پیشنهاد شده توسط :  ',
                        amount: '1کاربر',
                    },
                ],
                comments: [{
                    fullName: 'مونا',
                    publishedDate: '2 آبان 1400',
                    courseIdea: [
                        { amount: 8, title: 'موافقم' },
                        { amount: 2, title: 'مخالفم' },
                    ],
                    content: 'بسیار زیبا',
                }, ],
                tabs: [{
                        tab: 'توضیحات',
                        icon: 'mdi-sticker-text-outline',
                    },
                    { tab: 'نظرات', icon: 'mdi-comment-text-outline' },
                ],
            },
            emogyRate: {
                emojes: [
                    { name: 'mdi-emoticon-sad-outline', color: 'grey' },
                    { name: 'mdi-emoticon-confused-outline', color: 'grey' },
                    { name: 'mdi-emoticon-neutral-outline', color: 'grey' },
                    { name: 'mdi-emoticon-happy-outline', color: 'grey' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                ],
                rate: { vote: 1, score: 5 },
            },
            benefits: [
                { title: 'دسترسی به فایل محصول به صورت مادام‌العمر' },
                { title: 'تضمین کیفیت آموزش ها' },
                { title: 'فعال‌سازی آنی لینک دانلود، پس از ثبت سفارش' },
                { title: 'فروش فقط از طریق دیجی آکادمی' },
                { title: 'به صورت رایگان یک یا چند آموزش را دریافت می کنید.' },
            ],
            authore: {
                caption: 'فروشنده',
                fullName: 'ایلیا رضایی',
                content: '      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنانکه لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع باهدف بهبود ابزارهای کاربردی می باشد،',
            },
            btnCategory: [{ title: 'کتاب الکترونیکی', id: 9 }],
            breadcrumbs: [{
                    type: 'subject',
                    id: 9,
                    title: 'کتاب الکترونیکی',
                },
                {
                    type: 'product',
                    id: 51,
                    title: 'بابالنگ دراز',
                },
            ],
        },
        {
            id: 52,
            name: 'خودت باش دختر',
            englishName: 'be self girl',
            image: 'https://serajbookshop.com/wp-content/uploads/2021/09/be-your-own-girl-94.jpg',
            price: {
                amount: 55000,
                discount_amount: 5000,
                discount_percentage: 11,
                final_amount: 50000,
            },
            bookInfo: [{
                    title: ' حجم',
                    value: '7.8 مگابایت',
                    icon: 'mdi-arrow-down-circle-outline',
                },
                {
                    title: 'تیراژ',
                    value: 3000,
                    icon: 'mdi-google-analytics',
                },
                {
                    title: ' نوع فایل',
                    value: 'PDF',
                    icon: 'mdi-file-document-outline',
                },
                {
                    title: 'شابک',
                    value: 9786009495535,
                    icon: 'mdi-barcode',
                },
                {
                    title: ' زبان',
                    value: 'فارسی',
                    icon: 'mdi-translate',
                },
                {
                    title: ' تعداد صفحات',
                    value: 159,
                    icon: 'mdi-format-list-bulleted',
                },
                {
                    title: 'سال چاپ',
                    value: 1399,
                    icon: 'mdi-calendar-month-outline',
                },
                {
                    title: 'نویسنده',
                    value: ' ریچل هالیس',
                    icon: 'mdi-account',
                },
            ],
            detail: {
                description: '  <h3>معرفی کتاب خودت باش دختر</h3> <p> کتاب خودت باش دختر(Girl, wash your face) دربارۀ بسیاری از دروغ‌های دردناک و یک حقیقت مهم است.کدام حقیقت؟ تو و فقط خود تو مسئول آدمی هستی که می‌شوی و همچنین مسئول میزان شادی و رضایتی که از زندگی داری.این مفهوم اصلی کتاب ریچل هالیس(Rachel Hollis) است.اما اشتباه نکنید.ریچل قرار است برای شما صدها داستان خنده‌دار، عجیب، خجالت‌آور، غم‌انگیز یا مسخره تعریف کند که تمامشان به یک حقیقت ختم می‌شوند: زندگی تو به خودت بستگی دارد؛ اما تا وقتی دروغ‌هایی که بر سر راه رسیدن به این حقیقت قرار دارند را نشناسید این حقیقت قابل‌ باور نخواهد بود. </p><p>درک و باور اینکه تو خودت شادی‌ات را انتخاب می‌کنی و کنترل زندگی‌ات را به‌ دست داری بسیار مهم است. این مسئله یکی از آن نکاتی است که باید با هر دو دست آن را بگیریم و روی تابلوی اعلانات بزنیم تا همیشه یادمان بماند... اما این تنها نکته‌ای نیست که باید به آن باور داشته باشید. علاوه‌ بر این باید تمام دروغ‌هایی را که درطول زندگی به‌ خودتان گفته‌اید شناسایی کرده و همۀ آن‌ها را از بین ببرید.</p> <p> چرا؟ </p> <p> چون بدون آگاهی از اینکه الان کجا ایستاده‌اید نمی‌توانید به جای جدید بروید و تبدیل به آدمی جدید بشوید.وقتی از مطالعه دربارۀ کسی که تبدیل به آن شده‌اید به خودآگاهی می‌رسید، این شناخت برای باور اینکه واقعاً چه کسی هستید بسیار ارزشمند است. </p> <p> تا به‌ حال این فکر به‌ سرتان زده که آن‌ قدرها هم که باید خوب نیستید؟ که به‌ اندازۀ‌ کافی لاغر نیستید؟ که مادر بدی هستید؟ آیا این فکر به سرتان زده که لیاقت‌تان همین‌ است که با شما بدرفتاری شود؟ که هیچ ارزشی ندارید و هرگز به‌ جایی نخواهی رسید؟ </p> <p> تمامی این‌ها دروغ است. </p> <p>دروغ‌هایی که توسط جامعه، رسانه‌ها، خانواده‌هایمان، یا صادقانه بگویم، توسط خود شیطان ساخته شده و تداوم یافته‌اند. این دروغ‌ها برای اعتماد به‌ نفس و توانایی‌های ما خطرناک و ویرانگر هستند. بزرگ‌ترین گناه این دروغ‌ها این است که اصلاً آن‌ها را نمی‌شنویم. ما به‌ ندرت دروغ‌هایی را که دربارۀ خودمان ساخته‌ایم می‌شنویم چون سال‌هاست که آن‌ها با صدای بلند در گوش‌هایمان نجوا می‌شوند و از این‌ رو شنیدنشان تبدیل به امری عادی شده است. حرف‌های نفرت‌انگیزی که هر روز بر سرمان آوار می‌شوند اما متوجه‌شان نمی‌شویم. در کتاب خودت باش دختر در می‌یابیم که تشخیص دروغ‌هایی که در مورد خودمان باور کرده‌ایم کلید تبدیل شدن به نسخۀ بهتری از خودمان است. اگر هم‌ زمان با علم به اینکه بر ناملایمات زندگی‌مان تسلط داریم بتوانیم مرکز اصلی آن‌ها را نیز پیدا کنیم آن‌ وقت است که می‌توانیم به‌درستی مسیرمان را تغییر دهیم.</p> <p> حقیقت این است که شما قوی، مبارز و شجاع هستید...به این حقیقت بزرگ پی‌ببرید: تو خودت کنترل زندگی‌ات را در دست داری.تو تنها یک‌ بار و فقط یک بار شانس زندگی‌ کردن داری و این زندگی دارد از دستت می‌رود.خودت را دستِ‌ کم نگیر و این اجازه را به دیگران هم نده.به کمتر از حقت قانع نشو. </p> <p> گاهی برای تحت تأثیر‌ قراردادن و جلبِ‌ توجه کسانی که حتی دوستشان هم ندارید وسایلی را می‌خرید که از عهدۀ هزینه‌شان بر نمی‌آیید، این کار را کنار بگذارید.به‌ جای بروز دادن احساسات‌تان آن‌ها را درون خودتان نریزید و سرکوب نکنید.با این فکر که این‌ کار از مادری‌ کردن آسان‌تر است عشق فرزندان‌تان را با غذا و اسباب‌بازی و حتی رفاقت نخرید.از بدرفتاری با جسم و ذهنتان دست بردارید.زندگی‌تان قرار است سفری از یک مکان منحصر به‌ فرد به مکانی دیگر باشد؛ قرار نیست مثل یک چرخ‌ و فلک باشد که شما را مدام به همان نقطۀ قبلی برگرداند. </p><h3>در بخشی از کتاب خودت باش دختر می‌خوانیم:</h3> <p> ده‌ ساله بودم و در اردویی تابستانی به‌ سر می‌بردم.مشغول بازیِ پرچم را بگیر بودیم و حتی برای یک ثانیه هم قادر به کنترل ادرارم نبودم.دوست نداشتم کسی بفهمد شلوارم را خیس کرده‌ام بنابراین یک بطری آب روی خودم خالی کردم.تصور کنید!هیچ‌‌کس حتی کریستین کلارک(عشق دوران مدرسه‌ام) هم متوجه نمی‌شد.حتی آن‌ موقع هم بسیار زیرک و باهوش بودم. </p> <p> آیا برای بقیه عجیب بود که یک‌دفعه خیسِ آب شده بودم؟ </p> <p> این یک امر طبیعی‌ست؛ البته نه برای آن‌ موقع؛ چون من سه دفعه با فاصلۀ خیلی کم زایمان کرده‌ام.به‌ دنیا آوردن بچه مثل پرت‌ کردن موشک به هواست.همه‌ چیز را سرِ راهش خراب می‌کند و این بدان معناست که بله، من گاهی‌ اوقات شلوارم را خیس کرده‌ام.اگر شنیدن این موضوع احساسات لطیف شما را خدشه‌دار می‌کند در این‌ صورت تصور می‌کنم شما هرگز با مشکل کنترل‌ ادرار مواجه نشده‌اید.خیلی خوب، خوش‌ به‌ حالتان.اما اگر تجربۀ من از نظرتان با عقل جور در می‌آید پس شما هم این تجربه را داشته‌اید و این بدان معناست که از یادآوری وضعیت نامساعد مشابهی که در آن گیر کرده بودید به خنده افتاده‌اید. </p> <p> با پسرهایم در حالِ پریدن روی تشک پرش‌ درجا بودیم و بعد از انجام حرکت لمس انگشتان پا در حال پرش، یک‌ نفر برایم هورا کشید.این تنها مهارتی است که روی ترامپولین بلد هستم.اگر قرار باشد برای رفتن روی این تشک فنری که مثل تلۀ مرگ می‌ماند پیش‌ قدم شوم بهتر است بدانید که حاضرم با جان‌ و دل این کار را بکنم.در یک لحظه داشتم مثل دختری نوجوان که در مسابقات چیرلیدری شرکت می‌کند بالا و پایین می‌پریدم و در لحظۀ بعد شلوارم خیس شد.کسی متوجه نشد.مثل دفعۀ قبل عادی رفتار کردم.مجبور بودم به بالا و پایین‌ پریدن ادامه دهم تا شاید بادی که جریان پیدا می‌کرد شلوارم را خشک کند.من آدم باهوشی هستم، یادتان که نرفته؟ زمان‌بندی‌ام حرف نداشت چون کمتر از سی دقیقۀ بعد یک پست از پیش‌ برنامه‌‌ریزی‌ شده روی فیسبوک آپلود شد که من را در حال آماده‌ شدن برای حضور در مراسم اسکار نشان می‌داد. </p>',

                avgRating: 4,
                ratingHistogram: [
                    { rate: 5, amount: 100, value: 100 },
                    { rate: 5, amount: 100, value: 100 },
                    { rate: 5, amount: 100, value: 100 },
                    { rate: 5, amount: 100, value: 100 },
                    { rate: 0, amount: 0, value: 0 },
                ],
                reviewInfo: [{
                        title: 'تعداد دیدگاه : ',
                        amount: 4,
                    },
                    {
                        title: '  امتیاز کلی :',
                        amount: 20,
                    },
                    {
                        title: '  پیشنهاد شده توسط :  ',
                        amount: '4کاربر',
                    },
                ],
                comments: [{
                        fullName: 'نسرین',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 8, title: 'موافقم' },
                            { amount: 2, title: 'مخالفم' },
                        ],
                        content: 'کتاب خوبی بود خصوصا با ترجمه روان و دلنشینش  به نظرم تفاوتش با سایر کتابهای خودشناسی اینه که نویسنده خودش مسیر خودشناسیش روبا تجربه هاش بیان میکنه انگار بیشتر به خودش کمک میکنه و از طرفی اون کسی بوده که نظرات دیگران خیلی براش مهم بوده اما حالا به جایی رسیده کوچکترین و خصوصی‌ترین مسایل زناشویی و که زندگیشو بیان کرده البته بعضی مسایلش متفاوت با فرهنگ ماست در جاهایی هم خیلی اضافه گویی کرده و خیلی خیلی به شاغل بودنش افتخار کرده اما به قول خودش عاشق نوشتنه و به نظرات خوانندگانشم اهمیت نمی‌ده در کل انرژی بخش بود خصوصا جملات پایانی کتاب ',
                    },
                    {
                        fullName: 'اتینا',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 1, title: 'موافقم' },
                            { amount: 0, title: 'مخالفم' },
                        ],
                        content: 'اولین کتابی بودکه ازخانم هالیس خوندم. وقت نداشتم باعجله خوندم. یه تلنگرصمیمانه بود👌نمیشه گفت صرفایک کتاب میتونه شاه کلیدباشه برای رسیدن به نسخه بهترِخودت. کتابها و متن‌های انگیزشی خیلی زیادن، مهم به کار گرفتن راهکارهایی هست که ارائه میدن. این کتاب هم تاحدودی سطح آگاهیت روبالا میبره و شمارو وادار و به بازنگری فکری میکنه در مورد برخی باورها رفتارهایی که تاالان داشتی. در کل ارتباط خوبی با نویسنده برقرار کردم حین خوندنش و اینم یه جمله قشنگ از کتاب که دوس دارم تو ذهنم باقی بمونه:" با گذشت هر سال، یک فصل از کتابتان را به پایان میرسانید. لطفالطفالطفا آن یک فصل را هفتاد و پنج بار تکرار نکنید و اسمش را زندگی نگذارید. "',
                    },
                    {
                        fullName: 'ماریا',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 2, title: 'موافقم' },
                            { amount: 1, title: 'مخالفم' },
                        ],
                        content: 'یک کتاب بسیار عالی. خودت باش دختر به ما زن‌ها می‌آموزد به خودمان احترام بگذاریم، به خود اهمیت دهیم و با خودمان مهربانتر رفتار کنیم. این به این معنا نیست که مغرور و خودخواه باشیم بلکه با عشق ورزیدن به خودمان می‌توانم عزیزانی که در زندگی ما نقش مهمی دارند را نیز بیشتر دوست داشته باشیم',
                    },
                    {
                        fullName: 'شیرین',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 10, title: 'موافقم' },
                            { amount: 0, title: 'مخالفم' },
                        ],
                        content: 'عالی بود من اصلا نمیدش بزاریش زمیناحساس میکردم یکی درکم.میکنه و روبه روم نشسته و باهام حرف میزنه فهمیدم که یه زن میتونه قدرت مند باشه....یه زن شبیه چیزی که ازش میگن نیست اون خیلی قوی تره حتی میتونه خیلی مسائل رو داشته باشه که هر دختری تو زندگیش ممکنه فکر کنه بخاطر غیر عادیه یا تنها اون اینجوریه اما برای همه هست و همه تجربش میکنن...نویسنده خیلی صادقانه از زندگیش گفته و این خیلی به جذابیت کتاب اضافه میکرد....صفحه 188 رو خیلی دوست داشتم که ریچل میگه شخصیت یک انسان به وزنش نیست به اینه که چقدر به خودش اهمیت میده....در یک کلام به همع خانوما توصیه میکنم بخونن بهشون دید تازه‌ای میده ',
                    },
                ],
                tabs: [{
                        tab: 'توضیحات',
                        icon: 'mdi-sticker-text-outline',
                    },
                    { tab: 'نظرات', icon: 'mdi-comment-text-outline' },
                ],
            },
            emogyRate: {
                emojes: [
                    { name: 'mdi-emoticon-sad-outline', color: 'grey' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                ],
                rate: { vote: 4, score: 20 },
            },
            benefits: [
                { title: 'دسترسی به فایل محصول به صورت مادام‌العمر' },
                { title: 'تضمین کیفیت آموزش ها' },
                { title: 'فعال‌سازی آنی لینک دانلود، پس از ثبت سفارش' },
                { title: 'فروش فقط از طریق دیجی آکادمی' },
                { title: 'به صورت رایگان یک یا چند آموزش را دریافت می کنید.' },
            ],
            authore: {
                caption: 'فروشنده',
                fullName: 'کلثوم شیرعلی',
                content: '      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنانکه لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع باهدف بهبود ابزارهای کاربردی می باشد،',
            },
            btnCategory: [{ title: 'کتاب الکترونیکی', id: 9 }],
            breadcrumbs: [{
                    type: 'subject',
                    id: 9,
                    title: 'کتاب الکترونیکی',
                },
                {
                    type: 'product',
                    id: 52,
                    title: ' خودت باش دختر',
                },
            ],
        },

        {
            id: 53,
            name: 'ناتمام',
            englishName: 'not finished',
            image: 'https://img.ketabrah.ir/img/s/7483413619762306.jpg',
            price: {
                amount: 38000,
                discount_amount: 8000,
                discount_percentage: 9,
                final_amount: 13000,
            },
            bookInfo: [{
                    title: ' حجم',
                    value: '15 مگابایت',
                    icon: 'mdi-arrow-down-circle-outline',
                },
                {
                    title: 'تیراژ',
                    value: 3000,
                    icon: 'mdi-google-analytics',
                },
                {
                    title: ' نوع فایل',
                    value: 'PDF',
                    icon: 'mdi-file-document-outline',
                },
                {
                    title: 'شابک',
                    value: 9786009495535,
                    icon: 'mdi-barcode',
                },
                {
                    title: ' زبان',
                    value: 'فارسی',
                    icon: 'mdi-translate',
                },
                {
                    title: ' تعداد صفحات',
                    value: 159,
                    icon: 'mdi-format-list-bulleted',
                },
                {
                    title: 'سال چاپ',
                    value: 1399,
                    icon: 'mdi-calendar-month-outline',
                },
                {
                    title: 'نویسنده',
                    value: 'پریانکاچوپرا',
                    icon: 'mdi-account',
                },
            ],
            detail: {
                description: '<h3>درباره‌ی کتاب ناتمام:</h3> <p> سال‌های کودکی را در هند می‌گذراند و سه سال از نوجوانی‌اش را در آمریکا.در هفده‌سالگی، زیباترین دختر هند می‌شود و ناگهان به شهرتی جهانی دست می‌یابد.بعد از آن، سراغ بازیگری و تهیه‌کنندگی می‌رود و سفیر حسن نیت یونیسف می‌شود.این چند جمله چکیده‌ی زندگی نویسنده‌ی کتاب حاضر است، اما آیا سال‌های عمر یک انسان با فراز و نشیب‌هایش را می‌توان در چند جمله خلاصه کرد؟ کتاب ناتمام(Unfinished) به این پرسش پاسخ منفی می‌دهد، زیرا تجربه‌های زندگیْ جزئیات و ظرایف بسیاری دارد که فقط کسی که آن را زیسته قادر به بازگو کردن آن است. </p><p>زرگ شدن در هند آن هم در خانواده‌ای که هر دو والد پزشک ارتش‌اند چه احساسی دارد؟ گذراندن سال‌های نوجوانی در آمریکا و تجربه‌ی نژادپرستی، چطور؟ چگونه مسیر دختری که از خانواده‌ای این‌چنینی می‌آید به شرکت در مسابقه‌ی زیباترین دختر جهان ختم می‌شود؟ شهرت در سن پایین چه مزایا و معایبی دارد؟ بازیگری و تهیه‌کنندگی در بالیوود و هالیوود چه تفاوت‌هایی با یکدیگر دارند؟ و هزاران پرسش دیگری که هیچ‌کس جز پریانکا چوپرا جوناس (Priyanka Chopra Jonas) نمی‌تواند پاسخی به آن‌ها بدهد، چون این اتفاق‌ها آن‌قدر نادر و کمیاب‌اند که کمتر کسی در جهان آن‌ها را تجربه کرده است.</p><p>کتاب ناتمام، درست مانند نویسنده‌اش، اثری جسورانه، الهام‌بخش و سرکش است. این زندگی‌نامه می‌تواند برای سراسر افراد در جهان، خصوصاً دختران جوان، الگویی باشد تا بیاموزند که چگونه می‌توانند دست از رؤیاهایشان نکشند و اهداف خود را دنبال کنند. پریانکا چوپرا، با بیان زندگی خود، به ما نشان می‌دهد که کلید دستیابی به آرزوها تلاش خستگی‌ناپذیر و تعهد به اهداف است.</p><h3>در بخشی از کتاب ناتمام می‌خوانیم:</h3> <p> در ماه مارس سال نهم مدرسه، من، پیریام و پوجا بدون هیچ ناراحتی وسایلمان را جمع کردیم تا دوباره به خاله ماتهور ماسی ملحق شویم.ایندیانا هم مانند آیوا در غرب آمریکا قرار دارد و ازنظرِ سیاسی و اجتماعی ایالت محافظه‌کاری است؛ به‌عبارتِ‌ دیگر، زمین تا آسمان با نیویورک چندملّ یتی و آزاد متفاوت است.البته خیلی آزادی و سیاست برایم مطرح نبود.آن جا بود که برای اولین‌بار با یک پسر آشنا شدم؛ اسمش باب بود.(برای احترام به حریم خصوصی‌اش، اسم اصلی او را به‌کار نمی‌برم.) هر دوی ما در دبیرستان شمال مرکزی تحصیل می‌کردیم؛ البته او سال دهم بود.خیلی سریع عاشقش شدم.عضو تیم فوتبال مدرسه، و نمراتش هم بسیار خوب بود و درواقع تمام چیز‌هایی را که در دبیرستان آرزویش را داریم او یک‌جا داشت. </p><p>تمام عاشقانه‌ی ما در لحظاتی خلاصه می‌شد که باب پشت درِ کلاسم، خارج از دید معلم می‌ایستاد و برایم دست تکان می‌داد یا شکلک‌های خنده‌دار درمی‌آورد. آن جا منتظرم می‌ماند و بعد از تمام شدن کلاسم تا کلاس بعدی همراهی‌ام می‌کرد؛ اما من کمی در رابطه کُند پیش می‌رفتم. سرانجام به مرحله‌ای رسیدیم که دیگر عشقمان را پنهان نمی‌کردیم. یک روز زنجیرِ طلایی را که به گردن داشت باز کرد و دور گردن من بست. با خودم فکر کردم: یا خدا! ما داریم ازدواج می‌کنیم!</p>',

                avgRating: 5,
                ratingHistogram: [
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 5, amount: 5, value: 100 },
                ],
                reviewInfo: [{
                        title: 'تعداد دیدگاه : ',
                        amount: 5,
                    },
                    {
                        title: 'امتیاز کلی :',
                        amount: 25,
                    },
                    {
                        title: 'پیشنهاد شده توسط :  ',
                        amount: '5کاربر',
                    },
                ],
                comments: [{
                        fullName: 'مبینا',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 15, title: 'موافقم' },
                            { amount: 5, title: 'مخالفم' },
                        ],
                        content: 'عالیه من پریانکا چوپرا رو از زمان بچگی میشناسم و همیشه دوست داشتم بدونم که چطور زندگی‌ای داشته و تا اینکه این کتاب رو خوندم و فهمیدم که موفقیت خیلی هم غیر ممکن نیست شاید من و شما نمی‌بینیم و باور نمیکنم ولی اگه به خودمون ایمان داشته باشیم که میشه پس حتما میشه و موفق خواهیم شد پیشنهاد میکنم که این کتاب رو از دست ندید.',
                    },
                    {
                        fullName: 'ارش',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 11, title: 'موافقم' },
                            { amount: 12, title: 'مخالفم' },
                        ],
                        content: 'سپاس فراوان بسیارعالی',
                    },
                    {
                        fullName: 'ارام',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 4, title: 'موافقم' },
                            { amount: 2, title: 'مخالفم' },
                        ],
                        content: 'جذاب و اموزنده',
                    },
                    {
                        fullName: 'شاداب',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 3, title: 'موافقم' },
                            { amount: 1, title: 'مخالفم' },
                        ],
                        content: 'عالی',
                    },
                    {
                        fullName: 'ریما',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 7, title: 'موافقم' },
                            { amount: 2, title: 'مخالفم' },
                        ],
                        content: 'کاملا اموزنده',
                    },
                ],
                tabs: [{
                        tab: 'توضیحات',
                        icon: 'mdi-sticker-text-outline',
                    },
                    { tab: 'نظرات', icon: 'mdi-comment-text-outline' },
                ],
            },
            emogyRate: {
                emojes: [
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                ],
                rate: { vote: 5, score: 25 },
            },
            benefits: [
                { title: 'دسترسی به فایل محصول به صورت مادام‌العمر' },
                { title: 'تضمین کیفیت آموزش ها' },
                { title: 'فعال‌سازی آنی لینک دانلود، پس از ثبت سفارش' },
                { title: 'فروش فقط از طریق دیجی آکادمی' },
                { title: 'به صورت رایگان یک یا چند آموزش را دریافت می کنید.' },
            ],
            authore: {
                caption: 'فروشنده',
                fullName: 'زینب نادری',
                content: '      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنانکه لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع باهدف بهبود ابزارهای کاربردی می باشد،',
            },
            btnCategory: [{ title: 'کتاب الکترونیکی', id: 9 }],
            breadcrumbs: [{
                    type: 'subject',
                    id: 9,
                    title: 'کتاب الکترونیکی',
                },
                {
                    type: 'product',
                    id: 53,
                    title: 'ناتمام',
                },
            ],
        },
        {
            id: 54,
            name: 'خاطرات روزانه حوا',
            englishName: 'dayly memories of hava',
            image: 'https://img.ketabrah.ir/img/s/9937604882075808.jpg',
            price: {
                amount: 18000,
                discount_amount: 2000,
                discount_percentage: 12,
                final_amount: 16000,
            },
            bookInfo: [{
                    title: ' حجم',
                    value: '15 مگابایت',
                    icon: 'mdi-arrow-down-circle-outline',
                },
                {
                    title: 'تیراژ',
                    value: 3000,
                    icon: 'mdi-google-analytics',
                },
                {
                    title: ' نوع فایل',
                    value: 'PDF',
                    icon: 'mdi-file-document-outline',
                },
                {
                    title: 'شابک',
                    value: 9786009495535,
                    icon: 'mdi-barcode',
                },
                {
                    title: ' زبان',
                    value: 'فارسی',
                    icon: 'mdi-translate',
                },
                {
                    title: ' تعداد صفحات',
                    value: 159,
                    icon: 'mdi-format-list-bulleted',
                },
                {
                    title: 'سال چاپ',
                    value: 1399,
                    icon: 'mdi-calendar-month-outline',
                },
                {
                    title: 'نویسنده',
                    value: 'مارک تواین',
                    icon: 'mdi-account',
                },
            ],
            detail: {
                description: '<p>رمان خاطرات روزانه حوا، درباره‌ی روزهایی است که حوا آن‌ها را سپری کرده و از زمان تولد حوا آغاز می‌­شود به طوری‌ که در ابتدای رمان می‌گوید: «اکنون حدودا یک روز سن دارم، گویا دیروز به دنیا آمدم.»، اما باارزش‌ترین قسمت این کتاب لحظه‌ی ملاقات آدم و حوا در باغ عدن است که بسیار شنیدنی و گیراست. باید این موضوع را بدانید که رویدادهای موجود در این کتاب صوتی با رویدادهای واقعی که برای آدم و حوا رخ داده، متفاوت هستند.</p><p>البته در این خاطره‌گویی ما مسائل را تنها از زبان حوا نمی‌شنویم؛ چرا که آدم نیز به عنوان راوی دیگر داستان از منظر خود مسائل را نگاه می‌کند و با ما در میان می‌گذارد. وجود روایت هر دو شخصیت اصلی داستان به ما کمک می‌کند تا با احساسات حقیقی قهرمان‌های این داستان کهن بیشتر آشنا شویم.</p> <h3> بخشی از کتاب خاطرات روزانه حوا </h3><p>«در حال گشت و گذار بودم که ناگهان چیزی شبیه به غبار قرمز رنگی دیدم. دستم را داخل گذاشتم و حسش کردم... آخ! سریع دستم را کشیدم، درد شدیدی احساس کردم و انگشتم را درون دهانم گذاشتم. سوزشِ انگشتم آنقدر زیاد بود که سر از پا نمی‌شناختم و به بالا می‌پریدم. سعی کردم درد را تحمل کنم و این‌بار با کنجکاوی بیشتری به آن چیز قرمزرنگ نگریستم. خیلی دلم می‌خواست از آن سر در بیاورم. ناگهان اسمی از آن در ذهنم خطور کرد، لغتی که تا آن لحظه اصلا نشنیده بودم، آری نام آن آتش بود. اطمینان کامل داشتم که آتش بهترین کلمه‌ است.</p><p>من توانستم چیزی را خلق کنم که تا آن لحظه وجود نداشت. من چیزی جدید به جزئیات این دنیا اضافه کردم. خیلی مسرور بودم و دلم می‌خواست در مورد آتش به او بگویم، برایش تعریف‌ کنم که چگونه توانستم نامی جدید در این دنیا بوجود بیاورم. نه! نمی‌خواهم، کار درستی نیست، مطمئنم اگر به اون بگویم، هیچ واکنشی نشان نمی‌دهد و سر سوزنی توجه نمی‌کند. اگر درجواب جملاتم بگوید که آتش به چه کارمان می‌آید؟ چه چیزی می‌توانستم بگویم. این‌که بگویم حتما روزی به‌کار می‌آید یا زیباست قطعا روی او تاثیری نمی‌گذاشت.»</p>',

                avgRating: 0,
                ratingHistogram: [
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                ],
                reviewInfo: [{
                        title: 'تعداد دیدگاه : ',
                        amount: 0,
                    },
                    {
                        title: 'امتیاز کلی :',
                        amount: 0,
                    },
                    {
                        title: 'پیشنهاد شده توسط :  ',
                        amount: '0کاربر',
                    },
                ],
                comments: [],
                tabs: [{
                        tab: 'توضیحات',
                        icon: 'mdi-sticker-text-outline',
                    },
                    { tab: 'نظرات', icon: 'mdi-comment-text-outline' },
                ],
            },
            emogyRate: {
                emojes: [
                    { name: 'mdi-emoticon-sad-outline', color: 'grey' },
                    { name: 'mdi-emoticon-confused-outline', color: 'grey' },
                    { name: 'mdi-emoticon-neutral-outline', color: 'grey' },
                    { name: 'mdi-emoticon-happy-outline', color: 'grey' },
                    { name: 'mdi-emoticon-outline', color: 'grey' },
                ],
                rate: { vote: 0, score: 0 },
            },
            benefits: [
                { title: 'دسترسی به فایل محصول به صورت مادام‌العمر' },
                { title: 'تضمین کیفیت آموزش ها' },
                { title: 'فعال‌سازی آنی لینک دانلود، پس از ثبت سفارش' },
                { title: 'فروش فقط از طریق دیجی آکادمی' },
                { title: 'به صورت رایگان یک یا چند آموزش را دریافت می کنید.' },
            ],
            authore: {
                caption: 'فروشنده',
                fullName: 'زینب نادری',
                content: '      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنانکه لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع باهدف بهبود ابزارهای کاربردی می باشد،',
            },
            btnCategory: [{ title: 'کتاب الکترونیکی', id: 9 }],
            breadcrumbs: [{
                    type: 'subject',
                    id: 9,
                    title: 'کتاب الکترونیکی',
                },
                {
                    type: 'product',
                    id: 54,
                    title: 'خاطرات روزانه حوا',
                },
            ],
        },
        {
            id: 55,
            name: 'احتمال عشق در نگاه اول',
            englishName: 'love probably in onelook',
            image: 'https://img.ketabrah.ir/img/s/8874515173270703.jpg',
            price: {
                amount: 88000,
                discount_amount: 8000,
                discount_percentage: 18,
                final_amount: 80000,
            },
            bookInfo: [{
                    title: ' حجم',
                    value: '15 مگابایت',
                    icon: 'mdi-arrow-down-circle-outline',
                },
                {
                    title: 'تیراژ',
                    value: 3000,
                    icon: 'mdi-google-analytics',
                },
                {
                    title: ' نوع فایل',
                    value: 'PDF',
                    icon: 'mdi-file-document-outline',
                },
                {
                    title: 'شابک',
                    value: 9786009495535,
                    icon: 'mdi-barcode',
                },
                {
                    title: ' زبان',
                    value: 'فارسی',
                    icon: 'mdi-translate',
                },
                {
                    title: ' تعداد صفحات',
                    value: 159,
                    icon: 'mdi-format-list-bulleted',
                },
                {
                    title: 'سال چاپ',
                    value: 1399,
                    icon: 'mdi-calendar-month-outline',
                },
                {
                    title: 'نویسنده',
                    value: 'جنیفر ای اسمیت',
                    icon: 'mdi-account',
                },
            ],
            detail: {
                description: '<p>این کتاب درباره دختری نوجوان است که والدینش از همدیگر طلاق گرفته‌اند و به همین خاطر او به همه چیز از جمله مفهوم عشق و خانواده بدبین است تا اینکه بر حسب سرنوشت با پسری ملاقات می‌کند و زندگی‌اش دگرگون می‌شود. این رمان تاکنون نامزد جایزه‌های گودریدز، رود‌ آیلند و لینکلن شده است.</p><p>آیا شما هم به قدرت سرنوشت اعتقاد دارید؟ کتاب احتمال عشق در نگاه اول (The Statistical Probability of Love at First Sight) قصه دختری هفده ساله به نام هادلی را به تصویر می‌کشد که برای دومین جشن عروسی پدرش به لندن دعوت شده و باید خودش را به موقع به فرودگاه برساند. او که تاکنون مادرخوانده‌اش را هم ندیده از تمام این اتفاقات ناراحت و دلزده است و مدام به یاد خاطرات خوش گذشته می‌افتد؛ زمانی که پدر و مادرش از همدیگر طلاق نگرفته بودند و خانواده‌شان همچنان وجود داشت.</p><p>با این حال هادلی مجبور است خودش را به موقع برساند و راهی لندن شود اما پیش آمدن یک سری از اتفاقات کوچک و بی‌اهمیت، باعث می‌شود او چهار دقیقه دیرتر به فرودگاه برسد و از پرواز جا بماند. هادلی که از این موضوع ناراحت و متعجب است ناگهان در سالن شلوغ فرودگاه با پسری بریتانیایی به نام الیور ملاقات می‌کند که در همان ردیف صندلی‌هایی نشسته که هادلی حضور دارد. دیدار و هم‌نشینی میان آن دو تنها قرار است بیست و چهار ساعت طول بکشد اما این زمان کمی برای عاشق شدن و ایمان به قدرت سرنوشت است؟</p><h3>بخشی از کتاب</h3> <p> هدلی خواب است؛ بی‌هدف در رویا.در گوشه‌های دورافتاده ذهنش که حتی با اینکه بقیه وجودش از شدت خستگی از کار افتاده، هنوز ذهنش هشیار است او سوار آن یکی هواپیماست؛ همان پروازی که از آن جا ماند و حالا سه ساعت با پدرش فاصله دارد و کنار مردی میانسال با سبیلی پر پیچ و تاب نشسته است. </p><p>آن مرد کل مسیر روی اقیانوس اطلس عطسه می‌کند و می‌لرزد و حتی کلمه‌ای هم با هدلی حرف نمی‌زند. همچنان که اضطراب هدلی بیشتر می‌شود، دست‌هایش را روی پنجره فشار می‌دهد؛ درحالیکه آن سمت شیشه چیزی نیست به جز هیچ، هیچ و هیچ.</p> <p> هدلی چشم‌هایش را باز می‌کند و ناگهان یک دفعه کاملا بیدار می‌شود.چون صورت مراقب و آرام الیور را با حالتی در چهره‌اش که خواندنی نیست، فقط چند سانتی‌متر آن طرف‌تر خودش می‌بیند.هدلی که از شدت این نزدیکی هراسان شده است، دستش را روی قلبش می‌برد اما خیلی زود می‌فهمد که سرش روی شانه الیور است. </p>  ',
                avgRating: 1,
                ratingHistogram: [
                    { rate: 5, amount: 100, value: 100 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                ],
                reviewInfo: [{
                        title: 'تعداد دیدگاه : ',
                        amount: 1,
                    },
                    {
                        title: 'امتیاز کلی :',
                        amount: 5,
                    },
                    {
                        title: 'پیشنهاد شده توسط :  ',
                        amount: '1کاربر',
                    },
                ],
                comments: [{
                    fullName: 'کیمیا',
                    publishedDate: '2 آبان 1400',
                    courseIdea: [
                        { amount: 8, title: 'موافقم' },
                        { amount: 2, title: 'مخالفم' },
                    ],
                    content: 'جالب بود فراز و نشیب اینکه دو نفر احتمالی همدیگر را ببینند آن را جالب کرده بود  در جهانی که راههای زیادی برای ارتباط است و تو از هیچ کدامشان استفاده نکنی و به مقصد برسی ',
                }, ],
                tabs: [{
                        tab: 'توضیحات',
                        icon: 'mdi-sticker-text-outline',
                    },
                    { tab: 'نظرات', icon: 'mdi-comment-text-outline' },
                ],
            },
            emogyRate: {
                emojes: [
                    { name: 'mdi-emoticon-sad-outline', color: 'grey' },
                    { name: 'mdi-emoticon-confused-outline', color: 'grey' },
                    { name: 'mdi-emoticon-neutral-outline', color: 'grey' },
                    { name: 'mdi-emoticon-happy-outline', color: 'grey' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                ],
                rate: { vote: 1, score: 5 },
            },
            benefits: [
                { title: 'دسترسی به فایل محصول به صورت مادام‌العمر' },
                { title: 'تضمین کیفیت آموزش ها' },
                { title: 'فعال‌سازی آنی لینک دانلود، پس از ثبت سفارش' },
                { title: 'فروش فقط از طریق دیجی آکادمی' },
                { title: 'به صورت رایگان یک یا چند آموزش را دریافت می کنید.' },
            ],
            authore: {
                caption: 'فروشنده',
                fullName: 'زینب نادری',
                content: '      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنانکه لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع باهدف بهبود ابزارهای کاربردی می باشد،',
            },
            btnCategory: [{ title: 'کتاب الکترونیکی', id: 9 }],
            breadcrumbs: [{
                    type: 'subject',
                    id: 9,
                    title: 'کتاب الکترونیکی',
                },
                {
                    type: 'product',
                    id: 55,
                    title: 'احتمال عشق در نگاه اول',
                },
            ],
        },
        {
            id: 56,
            name: 'شازده کوچولو',
            englishName: 'amall shazdeh',
            image: 'https://img.ketabrah.ir/img/s/4034676382527454.jpg',
            price: {
                amount: 58000,
                discount_amount: 4000,
                discount_percentage: 11,
                final_amount: 54000,
            },
            bookInfo: [{
                    title: ' حجم',
                    value: '15 مگابایت',
                    icon: 'mdi-arrow-down-circle-outline',
                },
                {
                    title: 'تیراژ',
                    value: 3000,
                    icon: 'mdi-google-analytics',
                },
                {
                    title: ' نوع فایل',
                    value: 'PDF',
                    icon: 'mdi-file-document-outline',
                },
                {
                    title: 'شابک',
                    value: 9786009495535,
                    icon: 'mdi-barcode',
                },
                {
                    title: ' زبان',
                    value: 'فارسی',
                    icon: 'mdi-translate',
                },
                {
                    title: ' تعداد صفحات',
                    value: 159,
                    icon: 'mdi-format-list-bulleted',
                },
                {
                    title: 'سال چاپ',
                    value: 1399,
                    icon: 'mdi-calendar-month-outline',
                },
                {
                    title: 'نویسنده',
                    value: 'آنتوان دونست اگزوپری',
                    icon: 'mdi-account',
                },
            ],
            detail: {
                description: '<p>این کتاب شازده کوچولو (The Little Prince) با خاطرات دوران کودکی خلبانی دوست داشتنی شروع می‌شود. هنگامی که او 6 ساله بود، در کتابی راجع به جنگل و حیوانات تصویر زیبایی از یک مار بوآ که حیوان درنده‌ای را بلعیده بود، دید. در کتاب نوشته شده بود که مارهای بوآ شکار خود را بی‌آنکه بجوند درسته قورت می‌دهند. بنابراین کودک شش ساله تصمیم می‌گیرد یک نقاشی از مار بوآ که حیوانی را قورت داده است بکشد. پس از کشیدن نقاشی، وقتی او شاهکار خود را به آدم‌بزرگ‌ها نشان می‌داد کسی متوجه موضوع نمی‌شد و او سرشکسته می‌شود و نقاشی را کنار می‌گذارد. در ادامه نیز آنتوان از تجربه‌های شخصی خودش که زمانی در بیابانی گم شده بود، در این داستان استفاده کرده است، که ساختار اثر را باورپذیر و بی‌همتا می‌کند.</p><p>کتاب شازده کوچولو (به فرانسوی: Le Petit Prince) عنوان «کتاب قرن» را به خود اختصاص داده است، این اثر در قرن 20، یکی از پر فروش‌ترین و درخشان‌ترین کتاب‌ها بوده است و تاکنون 7 میلیون نسخه از این کتاب به چاپ رسیده است. به تعبیری، هر سال 100 نسخه از این کتاب منتشر می‌شود. طبق آمارهایی که در سال 2013 منتشر شده است، گفته می‌شود این رمان به 160 زبان ترجمه و بیش از 500 بار تجدید چاپ شده است.</p> <p> آنتوان دو سنت اگزوپری(Antoine Saint - Exupery) در شازده کوچولو فقط حقایق را شرح می‌دهد، حقایقی که به عقیده‌ی او به فراموشی سپرده شده‌اند.او در تلاش است با این اثر حقایق فراموش شده را یادآوری کند و عقیده دارد همه‌ی انسان‌ها در درون خود شازده کوچولویی دارند که باید به دنبال پیدا کردن آن باشند.او در این کتاب دوست داشتن، مهربانی و عشق را به ساده‌ترین و در عین حال تأثیرگذارترین حالت ممکن، به نحوی کنایه آمیز از زبان کودکی که از سیاره‌ای دیگر آمده روایت می‌کند. </p> <p> شازده کوچولو را نمی‌توان کتابی کودکانه به حساب آورد زیرا اگزوپری اصولاً نویسنده‌‌ی کتاب‌های کودک نیست.او در این رمان با زبانی کودکانه خستگی و دلزدگی‌اش از جهان بزرگترها را شرح می‌دهد. </p><p>آنتوان دو سنت اگزوپری (Antoine de Saint-Exupery) نویسنده، خبرنگار و خلبان اهل فرانسه بود، او شخصیتی ماجراجو داشت. همین ماجراجویی و توانایی‌اش در داستان‌نویسی و خلبانی باعث شد پرواز به مولفه اصلی داستان‌هایش مبدل شود. اگزوپری مردی متفکر بود و آثارش حاکی از تجربه‌های شخصی اوست، آثار او حاوی تخیل‌های نویسنده‌ای انسان دوست است که در دنیای وجدان و اخلاق به سر می‌برد و فلسفه‌اش را از عالم عینی و واقعی بیرون می‌کشد. وی در سال 1944 در حال پرواز ناپدید شد. او آثار درخشانی به یادگار گذاشت و مانند شخصیت‌های داستانی‌اش محبوب ماند. شخصیت پرجاذبه سنت اگزوپری که نمونه واقعی بلندی طبع و شهامت اخلاقی بود، پس از مرگش ارزش افسانه‌ای یافت و آثارش در شمار پرخواننده‌ترین آثار قرار گرفت.</p><h3>بخشی از کتاب</h3> <p> «روباه گفت: تو هنوز برای من پسربچه‌ای بیش نیستی مثل صدها هزار پسربچه دیگر و من نیازی به تو ندارم. تو هم نیازی به من نداری.من برای تو روباهی هستم شبیه به صدها هزار روباه دیگر. ولی تو اگر مرا اهلی کنی هر دو به هم نیازمند خواهیم شد.تو برای من در عالم همتا نخواهی داشت و من برای تو در دنیا یگانه خواهم بود. شازده کوچولو گفت: کم کم دارد دستگیرم می‌شود.یک گلی هست که گمانم مرا اهلی کرده باشد.» </p> <p> «آدم‌بزرگ‌ها ارقام را دوست دارند.وقتی با ایشان از دوست تازه‌ای صحبت می‌کنید هیچ‌وقت از شما راجع به آنچه اصل است نمی‌پرسند.هیچ‌وقت به شما نمی‌گویند که مثلا آهنگ صدای او چطور است؟ چه بازی‌هایی را بیشتر دوست دارد؟ آیا پروانه جمع می‌کند؟ بلکه از شما می‌پرسند: «چند سال دارد؟ چند برادر دارد؟ وزنش چقدر است؟ پدرش چقدر درآمد دارد؟» و تنها در آن وقت است که خیال می‌کنند او را می‌شناسند.اگر شما به آدم‌بزرگ‌ها بگویید: «من خانه زیبایی دیدم پشت‌بامش کبوتران…»، نمی‌توانند آن خانه را در نظر مجسم کنند.باید به ایشان گفت: «یک خانه صدهزار فرانکی دیدم!»آن وقت به بانگ بلند خواهند گفت: به به!چه خانه قشنگی!» </p>',

                avgRating: 5,
                ratingHistogram: [
                    { rate: 5, amount: 100, value: 100 },
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 5, amount: 5, value: 100 },
                ],
                reviewInfo: [{
                        title: 'تعداد دیدگاه : ',
                        amount: 5,
                    },
                    {
                        title: 'امتیاز کلی :',
                        amount: 25,
                    },
                    {
                        title: 'پیشنهاد شده توسط :  ',
                        amount: '5کاربر',
                    },
                ],
                comments: [{
                        fullName: 'الهام',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 8, title: 'موافقم' },
                            { amount: 2, title: 'مخالفم' },
                        ],
                        content: 'این کتاب مهمترین بخش زندگی رو دوستی و محبت میدونه، و معنای انسان رو عشق و دوستی تفسیر میکنه، به نظر من این ما هستیم که با عشق ورزیدن به کارهامون و افراد بهشون معنی میدیم، ما باید مثل یه هنرمند زندگی کنیم، به کارمون و افراد نه عشق بورزیم، مثل پادشاه قصد حکومت به انسان‌ها رو داشته باشیم نه مثل تاجر همه و همه چیز رو در مسیر پول ببینیم، نه مثل دانشمند فقط با چشم سر ببینیم و بگیم فقط همین نه هیچ چیز همین نیست، نه مثل یه خود بزرگ بین منتظر تشویق دیگران باشیم، ونه مثل شراب خوار فقط به فکر خودمون باشیم، بلکه مثل کسی باشیم که بی منت و انتظار به بقیه و خودش عشق میورزه و خودش رو مسعول علاقه‌ای که در دیگران ایجاد کرده بدونه، و عاشقانه زندگی کنیم چون تنها چیزی که میماند خاطر عشق ورزیدن و دوستی ماست.',
                    },
                    {
                        fullName: 'پوران',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 8, title: 'موافقم' },
                            { amount: 2, title: 'مخالفم' },
                        ],
                        content: 'اگزوپری با جملاتی ساده و زبانی کودکانه چهره‌ی جهانی پر از ناملایمت را با تمامی دشواری هایش در اذهان خوانندگانش به نمایش دراورده است اما در میان این دنیای خوف ناک شازده کوچولوی ما نماد ادم‌هایی ست که خودشان را در میان هیاهوی محیطی که در ان میزیند گم نکرده‌اند وآنگونه که میخواهند می‌اندیشند به چیزهایی که قابل شنیدن نیست گوش فرا می‌دهند و آنچه را که دیدنی نیست با چشم دل میبینند ',
                    },
                    {
                        fullName: 'سحر',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 8, title: 'موافقم' },
                            { amount: 2, title: 'مخالفم' },
                        ],
                        content: 'واقعا به هتون میگم این کتاب رو دانلود کنین واسه هر سنی خوبه من خودم الان ۱۰ سالمه و خیلی کتاب خوبیه و چیز‌های خوبی به ادم یاد میده این کتاب واقعا قوی است و صدای گوینده واقعا عالی بود ولی قسمت اخرش خیلی ناراحت کننده بود ',
                    },
                    {
                        fullName: 'فاطمه',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 8, title: 'موافقم' },
                            { amount: 2, title: 'مخالفم' },
                        ],
                        content: 'سلام من چند بار شازده کوچولو رو خوندم وهر بار هم خیلی هم لذت میبرم. ولی اخر داستان وماجرای نیش زدن مار را نمیتونم برا خودم حلش کنم ومثل یه علامت سوال بزرگ تو ذهنم مونده. ایا واقعا به مطلب خاصی اشاره داره، یا مار نماد چیز خاصی هست؟ با اصلا چرا این قسمت داستان اینقدر متفاوط هست با بقیه داستان. اگه دوستی نظری داشته باشه وبگه ممنون میشم. ',
                    },
                    {
                        fullName: 'رادان',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 8, title: 'موافقم' },
                            { amount: 2, title: 'مخالفم' },
                        ],
                        content: 'جهان هستی برسه اصلِ درستی در گردشه پندارگفتارکردارنیک. اگر خودمو درمسیرش قراربدیم به آرامش هرچیکه دوسداریم دست پیدامیکنیم. اگر کتاب رو خوندیم یا گوش دادیم ولی توجه نکنیم که درمسیر پندهای درستیکه شنیدیم خودمونو قراربدیم خوندنش مثل خوردن غذا و رفتن دسشویی میمونه که هیچ کارمفیدی نه برای خودت نه برای کسی انجام دادی.. کتاب عالی هستش..',
                    },
                ],
                tabs: [{
                        tab: 'توضیحات',
                        icon: 'mdi-sticker-text-outline',
                    },
                    { tab: 'نظرات', icon: 'mdi-comment-text-outline' },
                ],
            },
            emogyRate: {
                emojes: [
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                ],
                rate: { vote: 5, score: 25 },
            },
            benefits: [
                { title: 'دسترسی به فایل محصول به صورت مادام‌العمر' },
                { title: 'تضمین کیفیت آموزش ها' },
                { title: 'فعال‌سازی آنی لینک دانلود، پس از ثبت سفارش' },
                { title: 'فروش فقط از طریق دیجی آکادمی' },
                { title: 'به صورت رایگان یک یا چند آموزش را دریافت می کنید.' },
            ],
            authore: {
                caption: 'فروشنده',
                fullName: 'زینب نادری',
                content: '      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنانکه لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع باهدف بهبود ابزارهای کاربردی می باشد،',
            },
            btnCategory: [{ title: 'کتاب الکترونیکی', id: 9 }],
            breadcrumbs: [{
                    type: 'subject',
                    id: 9,
                    title: 'کتاب الکترونیکی',
                },
                {
                    type: 'product',
                    id: 56,
                    title: 'شازده کوچولو',
                },
            ],
        },
        {
            id: 57,
            name: 'اشکال ندارد که حالت خوب نیست',
            englishName: 'no problem that you are not good',
            image: 'https://img.taaghche.com/frontCover/103886.jpg?w=400',
            price: {
                amount: 22000,
                discount_amount: 7000,
                discount_percentage: 16,
                final_amount: 15000,
            },
            bookInfo: [{
                    title: ' حجم',
                    value: '15 مگابایت',
                    icon: 'mdi-arrow-down-circle-outline',
                },
                {
                    title: 'تیراژ',
                    value: 3000,
                    icon: 'mdi-google-analytics',
                },
                {
                    title: ' نوع فایل',
                    value: 'PDF',
                    icon: 'mdi-file-document-outline',
                },
                {
                    title: 'شابک',
                    value: 9786009495535,
                    icon: 'mdi-barcode',
                },
                {
                    title: ' زبان',
                    value: 'فارسی',
                    icon: 'mdi-translate',
                },
                {
                    title: ' تعداد صفحات',
                    value: 159,
                    icon: 'mdi-format-list-bulleted',
                },
                {
                    title: 'سال چاپ',
                    value: 1399,
                    icon: 'mdi-calendar-month-outline',
                },
                {
                    title: 'نویسنده',
                    value: 'مگان دیواین',
                    icon: 'mdi-account',
                },
            ],
            detail: {
                description: '<p>این کتاب به شما می اموزد به شما می‌آموزد که به جای تلاش بیهوده برای واپس راندن اندوه، بهتر آن است وجود آن را در خود بپذیرید و آرامش را از خلال تجربه‌ی رنج و سوگواری به دست آورید. به طور کلی باید گفت رویکردی که در این اثرِ تحسین‌شده ارائه گشته، در نوع خود بسیار خاص و متفاوت است.</p><p>رویکردی که مگان دیواین در این کتاب ساخته و پرداخته، اگرچه در تناسب با آخرین یافته‌های علم روانشناسی است، با این حال از آموزه‌های حکمت‌آمیز باستانی نیز خالی نیست. عقاید او، علاوه بر مسیحیت، به وضوح تأثیرگرفته از دو مکتب فکری رواقی‌گری و بودیسم است. چه، هدف بنیانگذاران این دو جریان فکری نیز، چیزی جز ارائه‌ی راه حلی برای بهتر زیستن در جهانی که پایه و بنیادش بر درد و رنج استوار است، نبود.</p><p>زمانی که می‌گوییم بودا توصیه کرد «سرتاسر زندگی در رنج به سر بردن است و راه فرار از آن پذیرش ناپایداری است»، یعنی او نگفته است «لطفاً وانمود کن هیچ رنجی نمی‌بینی یا لطفاً تظاهر کن که درون درد نیستی». او نگفته است «تو اگر فقط وابستگی‌هایت را کنار بگذاری، هیچ چیزی به تو آسیب نمی‌رساند». او رنج را دیده بود. او درد را دیده بود. او می‌خواست این درد همچنان وجود داشته باشد و به آن واکنش نشان دهد. واکنشی بدون شانه خالی کردن؛ بدون روی برگرداندن از حفره‌ی اندوهی که در دنیایت پدید آمده است.</p><p>ودا درد را دید و پرسید: «چه کاری می‌توانم انجام دهم تا در میان این درد قلبم و عقلم را از دست ندهم؟ چطور می‌توانم قلبم و چشمان را بگشایم، بدون اینکه با درد از پا دربیایم؟ چگونه می‌توانم چیزی را بنگرم که می‌دانم التیام نمی‌پذیرد؟» پاسخ، در هر حال در ذهن من، عشق بود...</p> <h3>بخشی از کتاب</h3> <p> -این زندگی توست.زندگی‌ای که حالا باید در میان ویرانه‌ای که دنیای توست آن را بنا کنی.جایی که هر آنچه پیش از این بودی، هم پیداست و هم ناپیدا...یک ویرانه با بخش‌هایی یکسان از تباهی و بالیدن.ویرانه‌ای از تاریکی و روشنی؛ آب و زمین خشک؛ گِ ل و سبزه.کار واقعی اندوه ساختن خانه‌ای در میانه‌ی اندوه است. </p><p>- اینکه زندگی دوستت در گذشته خوب بوده است، منصفانه نیست الان پیچیده در درد باشد. در کنار دوستت حضور داشته باش، حتی اگر زندگی‌اش درحال‌حاضر آکنده از درد باشد.</p> <p>- اندوه یک تجربه‌ی بسیار شخصی‌، و کاملاً متعلق به فردی است که در حال تجربه‌ی آن است. تو ممکن است باور داشته باشی که اگر چنین اتفاقی برایت بیافتد طور دیگری با آن برخورد می‌کنی.</p>   ',

                avgRating: 0,
                ratingHistogram: [
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                ],
                reviewInfo: [{
                        title: 'تعداد دیدگاه : ',
                        amount: 0,
                    },
                    {
                        title: 'امتیاز کلی :',
                        amount: 0,
                    },
                    {
                        title: 'پیشنهاد شده توسط :  ',
                        amount: '0کاربر',
                    },
                ],
                comments: [],
                tabs: [{
                        tab: 'توضیحات',
                        icon: 'mdi-sticker-text-outline',
                    },
                    { tab: 'نظرات', icon: 'mdi-comment-text-outline' },
                ],
            },
            emogyRate: {
                emojes: [
                    { name: 'mdi-emoticon-sad-outline', color: 'grey' },
                    { name: 'mdi-emoticon-confused-outline', color: 'grey' },
                    { name: 'mdi-emoticon-neutral-outline', color: 'grey' },
                    { name: 'mdi-emoticon-happy-outline', color: 'grey' },
                    { name: 'mdi-emoticon-outline', color: 'grey' },
                ],
                rate: { vote: 0, score: 0 },
            },
            benefits: [
                { title: 'دسترسی به فایل محصول به صورت مادام‌العمر' },
                { title: 'تضمین کیفیت آموزش ها' },
                { title: 'فعال‌سازی آنی لینک دانلود، پس از ثبت سفارش' },
                { title: 'فروش فقط از طریق دیجی آکادمی' },
                { title: 'به صورت رایگان یک یا چند آموزش را دریافت می کنید.' },
            ],
            authore: {
                caption: 'فروشنده',
                fullName: 'زینب نادری',
                content: '      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنانکه لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع باهدف بهبود ابزارهای کاربردی می باشد،',
            },
            btnCategory: [{ title: 'کتاب الکترونیکی', id: 9 }],
            breadcrumbs: [{
                    type: 'subject',
                    id: 9,
                    title: 'کتاب الکترونیکی',
                },
                {
                    type: 'product',
                    id: 57,
                    title: 'اشکال ندارد که حالت خوب نیست',
                },
            ],
        },
        {
            id: 58,
            name: 'خود برتر: خودت باش، فقط کمی بهتر',
            englishName: 'top self ; be self but a bit better',
            image: 'https://img.ketabrah.ir/img/s/4323197335111646.jpg',
            price: {
                amount: 82000,
                discount_amount: 2000,
                discount_percentage: 5,
                final_amount: 80000,
            },
            bookInfo: [{
                    title: ' حجم',
                    value: '15 مگابایت',
                    icon: 'mdi-arrow-down-circle-outline',
                },
                {
                    title: 'تیراژ',
                    value: 3000,
                    icon: 'mdi-google-analytics',
                },
                {
                    title: ' نوع فایل',
                    value: 'PDF',
                    icon: 'mdi-file-document-outline',
                },
                {
                    title: 'شابک',
                    value: 9786009495535,
                    icon: 'mdi-barcode',
                },
                {
                    title: ' زبان',
                    value: 'فارسی',
                    icon: 'mdi-translate',
                },
                {
                    title: ' تعداد صفحات',
                    value: 159,
                    icon: 'mdi-format-list-bulleted',
                },
                {
                    title: 'سال چاپ',
                    value: 1399,
                    icon: 'mdi-calendar-month-outline',
                },
                {
                    title: 'نویسنده',
                    value: 'مایک بایر',
                    icon: 'mdi-account',
                },
            ],
            detail: {
                description: '<p>کتاب خود برتر: خودت باش، فقط کمی بهتر اثر مایک بایر، از عناوین پرفروش سال ۲۰۱۹ نیویورک‌تایمز، به شما نشان می‌دهد، چگونه استعدادهای نهانی خود را به بالاترین سطح ممکن برسانید و در تأثیرگذارترین راه ممکن، بهترین انسانی که می‌توانید باشید را کشف کنید. همه‌چیز برای رسیدن به «خودِ برتر» از خود شما آغاز می‌شود و به خود شما ختم می‌شود.</p><p>از خودتان سوال کنید... آیا به راستی همان کسی هستید که دلتان می‌خواهد؟ آیا این زندگی همان زندگی باب طبع شماست؟ آیا هر روز خود را مطابق با خود برترتان سپری می‌کنید؟ چه چیزی را همین امروز می‌توانید تغییر دهید؟</p><p>چگونه به این سوالات جواب خواهید داد؟ به زندگی روزمره‌تان فکر کنید. آیا در حال ارتقای زندگی‌تان هستید یا فقط از روی عادت آن را می‌گذرانید؟ آیا روزهایتان سرشار از کار، ارتباط و فعالیت‌هایی همسو با حقیقت درونتان هستند، یا احساس می‌کنید روی تردمیلی از مسئولیت‌های اجباری گیر افتاده اید؟</p><p>اگر خواستار زندگی بهتری هستید، همین حالا زمانش فرا رسیده است؛ آرزوی خود را به واقعیت تبدیل کنید. ابزار این کار در دستان شماست تا بتوانید زندگی رضایت‌بخشی را در بالاترین سطح برای خود بیافرینید.</p><p>کتاب خود برتر: خودت باش، فقط کمی بهتر (Best self: be you only better) از پرفروش‌ترین کتاب‌های نیویورک تایمز در سال ۲۰۱۹، راه را نشان‌تان خواهد داد.</p> <p> مایک بایر(Mike Bayer) یک استاد حرفه‌ای و واقعی است و« خودِ برتر» کتاب مقدس اوست؛ او یک راهنمای باشعور و اهلِ عمل است که به شما نشان می‌دهد چگونه از جایی که اکنون هستید به جایی برسید که می‌خواهید باشید، آن هم در تمام زمینه‌های زندگی‌تان؛ شخصی، خانوادگی، کاری، معنوی یا در همۀ‌ زمینه‌های فوق.نمی‌توان گفت که مایک دستی در هر چیزی دارد، بلکه فقط فرمانروای تمام جنبه‌های زندگی‌تان را به شما نشان می‌دهد و آن شخص کسی نیست جز خود شما. </p><p>مایک واسطه‌ای بی‌نظیر در تغییر زندگی افراد است‌. او همان کسی است که دنبالش بوده‌اید: باهوش، متفکر، صادق، با اخلاص، صریح و متعهد. او در کتاب «خودِ برتر» تمام حرف‌هایش را بازگو می‌کند. این کتاب جزو آن دسته کتاب‌هایی است که هنگام اتمامش شما را در حالی ترک می‌کند که بهتر از قبل شده‌اید. در خلال صفحات کتاب، مایک راهنمای زندگی شما خواهد بود و در طول این سفر شما را با سؤالاتی تأمل‌برانگیز و تحریک کننده که هرگز با آن‌ها مواجه نشده‌اید هدایت می‌کند. بایر انسان‌ها را دقیقاً همان‌جایی که قرار دارند ملاقات می‌کند، بدون کوچک‌ترین قضاوت و با مهربانی و آرامش آن‌ها را به‌سمت خودِ واقعی‌شان راهنمایی می‌کند. در طول خواندن این کتاب و بررسی تمام جنبه‌های زندگی‌تان در مسیر بهتر شدنِ خود، این مهربانی را کاملاً حس خواهید کرد.</p><p>همان‌طور که اغلب اوقات می‌گوییم، نمی‌توانید چیزی را که به آن واقف نیستید تغییر دهید. اکنون زمان آن فرارسیده که صداقت را آغاز کنید. شاید فکر کنید تغییر واقعی برایتان غیرممکن است یا اینکه آسیب‌های وارد شده به روابط‌تان جبران ناپذیرند یا زندگی‌تان نابود شده یا از رؤیاهای‌تان بیش از حد فاصله گرفته‌اید. این کتاب به شما می‌گوید که هیچ‌کدام از این‌ها حقیقت ندارد، البته اگر مشتاق باشید که این کار را انجام دهید و قبول کنید که می‌شود کاری انجام داد. قطعاً باید ابزار مورد نیاز را هم در دست داشته باشید؛ عقیده‌ای که بتوان تغییر داد، اشتیاقی که بتوان این کار را انجام داد و همچنین کتاب خودِ برتر اثر مایک بایر. گذشته تمام شده و آینده هنوز فرا نرسیده است. زمان اصلی، اکنون است و راهنمای شما، کتاب خودِ برتر.</p><h3>بخشی از کتاب</h3> <p> همۀ ما هنرمند هستیم.ازنظر من، هنرمند کسی است که خودِ واقعی‌اش را به نمایش می‌گذارد.همگی ما دارای این توانایی هستیم که کار زیبایی انجام دهیم؛ کاری که دیگران از آن بهره می‌برند و منحصر به فرد است.من درمورد هنری که نیاز به قلم و بوم نقاشی دارد صحبت نمی‌کنم، بلکه معتقدم به تعداد انسان‌های روی زمین شکل‌های منحصر‌ به فردی از هنر وجود دارد. </p><p>من کاملاً اتفاقی هنر خودم را کشف کردم و فکر می‌کنم اکثر انسان‌ها هم همین‌گونه اتفاقی هنرشان را کشف کرده‌اند. سفر زندگی من همیشه پر از پیچ‌و‌تاب، پستی و‌ بلندی و حتی لحظه‌هایی از سکون بوده است و ازطریق همان تجربیات است که توانسته‌ام با خود و دیگران ارتباط برقرار کنم. ازطریق آن ارتباطات توانستم هنرم را کشف کنم. هنر من کمک کردن به دیگران است تا از قید‌ و بند رها شده و به بهترین بُعد خود تبدیل شوند. شاید بتوان اینگونه گفت که هنر من کمک کردن به شماست تا هنر خودتان را کشف کنید و همین معنای زندگی‌ای است که هم‌اکنون در آن قرار دارید؛ یعنی به کارگیری بهترین شکل از خودِ برترتان در زندگی.</p><p>تمام کسانی که با آن‌ها کار کرده‌ام می‌توانند به شما بگویند که وقتی از آن‌ها می‌پرسم هنر شما چیست با تعجب به من نگاه می‌کنند. در واقع منظور من از این سؤال این است که آن‌ها چگونه خودِ واقعی‌شان را در زندگی روزمره نشان می‌دهند. از شغل و حرفه‌شان گرفته تا ارتباط با خانواده و سرگرمی و چیزهای دیگر.</p><p>به عنوان‌ مثال، درمانگری که در مرکز بازپروری من کار می‌کند هنر منحصر‌ به فردش را هر روز ازطریق کار‌کردن با مراجعه کنندگان نشان‌ می‌دهد، چون بزرگ‌ترین هدفش این است به آن‌ها کمک کند تا از تله‌ای که در آن افتاده‌اند رها شوند. پرسنلی که در قسمت بازپروری زندگی کار می‌کنند هنرشان این است که به مراجعه کنندگان کمک کنند تا مراقبت و عشق‌ورزی را حس کنند. زنی که قبل از همه به مرکز می‌رسد تا اتاق‌ها را تمیز کند هنرش ایجاد فضایی تمیز و مرتب است. مدیر منابع انسانی هنرش این است که تمام تمرکزش را روی برقراری آرامش بگذارد. بودن بین گروهی که هنر منحصر‌ به فرد خودشان را هر روز با هدف مشترکی بروز می‌دهند قابل‌ستایش است. هدف مشترک این گروه باعث می‌شود الهام و انگیزه بگیرند.</p>',

                avgRating: 2,
                ratingHistogram: [
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                ],
                reviewInfo: [{
                        title: 'تعداد دیدگاه : ',
                        amount: 2,
                    },
                    {
                        title: 'امتیاز کلی :',
                        amount: 10,
                    },
                    {
                        title: 'پیشنهاد شده توسط :  ',
                        amount: '2کاربر',
                    },
                ],
                comments: [{
                        fullName: 'هادی',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 3, title: 'موافقم' },
                            { amount: 3, title: 'مخالفم' },
                        ],
                        content: 'سلام واقعا کتاب‌هایی از این دست بسیار توی زندگی‌ما ادمها تاثیر گذارن البته برای افرادی که میخوان واقعا نقاط مثبت شخصیتی شون رو تقویت کنند و همچنین برای خودشون ارزش بیشتری قائل بشن من که دو بار این کتاب رو خوندم و دوبار هم تمرین هاشو انجام دادم به همه‌ی افرادی که به دنبال تغییرر درونی هستند شدیدا توصیخ میکنم. ',
                    },
                    {
                        fullName: 'رادان',
                        publishedDate: '2 آبان 1400',
                        courseIdea: [
                            { amount: 1, title: 'موافقم' },
                            { amount: 1, title: 'مخالفم' },
                        ],
                        content: 'بیشتر تجربه‌های یک شخص هست ضمن اینکه در خلاصه‌ای که نوشته شده به نظر کتاب راجع به شخصیت مایک هستش تا تجربیاتی مفید مایک، ستایش مایک به عنوان یک لیدر به نظرم خلاصه کتاب باید جذابتر نوشته بشه و اگر هم کل کتاب همینه بهتر بجای نشر اینگونه کتابها زندگینامه افراد موفق داخل کشور خودمون که موفق تر و قوی تر از ایشون هستند در اینجا قرار بگیره',
                    },
                ],
                tabs: [{
                        tab: 'توضیحات',
                        icon: 'mdi-sticker-text-outline',
                    },
                    { tab: 'نظرات', icon: 'mdi-comment-text-outline' },
                ],
            },
            emogyRate: {
                emojes: [
                    { name: 'mdi-emoticon-sad-outline', color: 'grey' },
                    { name: 'mdi-emoticon-confused-outline', color: 'grey' },
                    { name: 'mdi-emoticon-neutral-outline', color: 'grey' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                ],
                rate: { vote: 2, score: 10 },
            },
            benefits: [
                { title: 'دسترسی به فایل محصول به صورت مادام‌العمر' },
                { title: 'تضمین کیفیت آموزش ها' },
                { title: 'فعال‌سازی آنی لینک دانلود، پس از ثبت سفارش' },
                { title: 'فروش فقط از طریق دیجی آکادمی' },
                { title: 'به صورت رایگان یک یا چند آموزش را دریافت می کنید.' },
            ],
            authore: {
                caption: 'فروشنده',
                fullName: 'زینب نادری',
                content: '      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنانکه لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع باهدف بهبود ابزارهای کاربردی می باشد،',
            },
            btnCategory: [{ title: 'کتاب الکترونیکی', id: 9 }],
            breadcrumbs: [{
                    type: 'subject',
                    id: 9,
                    title: 'کتاب الکترونیکی',
                },
                {
                    type: 'product',
                    id: 58,
                    title: 'خود برتر: خودت باش، فقط کمی بهتر',
                },
            ],
        },
        {
            id: 59,
            name: 'دختری از بروکلین',
            englishName: 'a girl from broklin',
            image: 'https://img.ketabrah.ir/img/s/5321906839755655.jpg',
            price: {
                amount: 22000,
                discount_amount: 7000,
                discount_percentage: 30,
                final_amount: 15000,
            },
            bookInfo: [{
                    title: ' حجم',
                    value: '15 مگابایت',
                    icon: 'mdi-arrow-down-circle-outline',
                },
                {
                    title: 'تیراژ',
                    value: 3000,
                    icon: 'mdi-google-analytics',
                },
                {
                    title: ' نوع فایل',
                    value: 'PDF',
                    icon: 'mdi-file-document-outline',
                },
                {
                    title: 'شابک',
                    value: 9786009495535,
                    icon: 'mdi-barcode',
                },
                {
                    title: ' زبان',
                    value: 'فارسی',
                    icon: 'mdi-translate',
                },
                {
                    title: ' تعداد صفحات',
                    value: 159,
                    icon: 'mdi-format-list-bulleted',
                },
                {
                    title: 'سال چاپ',
                    value: 1399,
                    icon: 'mdi-calendar-month-outline',
                },
                {
                    title: 'نویسنده',
                    value: 'گیوم موسو',
                    icon: 'mdi-account',
                },
            ],
            detail: {
                description: '<p>سه هفته پیش از ازدواج یک زوج عاشق، صحنه‌ای دراماتیک و رو به دریا؛ آنا از رافائل می‌پرسد: «اگر متوجه شوی که من یک جنایت‌کار هستم، آیا باز هم مرا دوست خواهی داشت؟!» جمله‌ی تکان‌دهنده‌ای که رافائل نمی‌داند چه پاسخی بدهد!</p> <p> گیوم موسو(Guillaume Musso) داستان دختری از بروکلین(Brooklyn Girl) را این چنین آغاز می‌کند.او این کتاب را در سال 2016 براساس داستان زندگی ناتاشا کامپوش منتشر کرد. </p><p>رمان پرفروش و معمایی دختری از بروکلین داستان فاش شدن رازی هولناک را روایت می‌کند که زندگی رافائل و آنا را دگرگون کرد. رافائل نویسندۀ سرشناسی است که کتاب‌های پلیسی و جنایی می‌نویسد و پسر کوچکش حاصل ازدواج ناموفق اوست. مریضی ناگهانی پسر رافائل سبب آشنا شدن او با آنا می‌شود که پزشک کودکان است. دیری نمی‌پاید که ارتباط آنا و رافائل به سمت و سویی فراتر از ارتباط یک پزشک و بیمار می‌رود.</p><p>این زوج عاشق و خوشبخت، چند روز پیش از مراسم عروسی‌شان به تعطیلات می‌روند و این شروع طوفانی ویرانگر از حوادث غیرقابل پیش‌بینی است! چیزی در گذشته آنا جود دارد که کنجکاوی رافائل را برانگیخته. گذشتۀ آنا همچون دروازه ورود به جهنمی به روی آن دو نفر باز می‌شود و همه چیز را تحت تاثیر می‌گذارد.</p><h3>خواندن کتاب دختری از بروکلین به چه کسانی پیشنهاد می‌شود؟</h3> <p> تمامی دوستداران داستان‌های معمایی و هیجانی از خواندن کتاب دختری از بروکلین لذت خواهند برد.همچنین اگر به رمان‌های فرانسوی جنایی علاقمندید خواندن این کتاب را به شما توصیه می‌کنیم. </p><h3>بخشی از کتاب</h3><p>حدود بیست سالى مى‌شد که مارک ماشینش را تغییر نداده بود. بیش از سیصد هزار کیلومتر با آن رانندگى کرده بود ولى هنوز هم هربار که پشتش مى‌نشست، احساس لذت مى‌کرد و حاضر نبود آن را با بهترین و جدیدترین ماشین‌ها تعویض کند. تئو را به آمالیا سپرده بودم و از اینکه مارک همراهم بود احساس آسودگى خاطر مى‌کردم. </p> <p> هنوز امیدوار بودم که همه چیز به خوبى و خوشى تمام شود.شاید آنا خیلى زود برمى‌گشت.شاید اصلاً رازى که با خود داشت چیز آنچنان مهمى نبود.امیدوار بودم زندگى‌ام خیلى زود روال عادى خودش را از سرگرفته و بتوانم طبق برنامه‌اى که داشتیم و سر موقع، مراسم ازدواجمان را برگزار کنم. </p><p>قرار بود اواخر ماه سپتامبر در کلیساى سن گیلم لودزر مراسم را برگزارکنیم که به طور سنتى همه مراسم خانوادگى ما در آنجا برگزار مى‌شد. عطر عجیبى در ماشین مارک جریان داشت. در بهترین حالت مى‌شد گفت ماشینى قدیمى بود. هربار که وارد یک سربالایى مى‌شدیم، وضعیتى پیش مى‌آمد که انگار قرار بود هر لحظه خاموش شود ولى بالاخره خود را به انتهاى مسیر مى‌رساند. در خیابان بیستم در حال حرکت بودیم و در نهایت به خانه آنا رسیدیم. درحالى‌که به آن اشاره مى‌کردم گفتم: «اوناهاش اونجاست؛ ولى نمى‌تونى از اینجا رد بشى، باید برى تا چراغ، بعدش دور بزنى...»</p> ',

                avgRating: 1,
                ratingHistogram: [
                    { rate: 5, amount: 5, value: 100 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                ],
                reviewInfo: [{
                        title: 'تعداد دیدگاه : ',
                        amount: 1,
                    },
                    {
                        title: 'امتیاز کلی :',
                        amount: 5,
                    },
                    {
                        title: 'پیشنهاد شده توسط :  ',
                        amount: '1کاربر',
                    },
                ],
                comments: [{
                    fullName: 'نادر',
                    publishedDate: '2 آبان 1400',
                    courseIdea: [
                        { amount: 8, title: 'موافقم' },
                        { amount: 2, title: 'مخالفم' },
                    ],
                    content: 'خود کیفر از ترس لو رفتن کلبه و خودش و دخترا رو آتیش زده... منظور آنا یا همون کلر از این که به رافائل عکس جنازه‌ها رو نشون داده و گفته که من این کار رو کردم این بوده که کاش از وجود اونا خبر داشت و به پلیس خبر میداد... این که گفته من این کار رو کردم منظورش این بوده که با فرارش و خبر ندادن به پلیس باعث شده کیفر خودش و دخترا رو آتش بزنه... حس عذاب وجدان داشت',
                }, ],
                tabs: [{
                        tab: 'توضیحات',
                        icon: 'mdi-sticker-text-outline',
                    },
                    { tab: 'نظرات', icon: 'mdi-comment-text-outline' },
                ],
            },
            emogyRate: {
                emojes: [
                    { name: 'mdi-emoticon-sad-outline', color: 'grey' },
                    { name: 'mdi-emoticon-confused-outline', color: 'grey' },
                    { name: 'mdi-emoticon-neutral-outline', color: 'grey' },
                    { name: 'mdi-emoticon-happy-outline', color: 'grey' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                ],
                rate: { vote: 1, score: 5 },
            },
            benefits: [
                { title: 'دسترسی به فایل محصول به صورت مادام‌العمر' },
                { title: 'تضمین کیفیت آموزش ها' },
                { title: 'فعال‌سازی آنی لینک دانلود، پس از ثبت سفارش' },
                { title: 'فروش فقط از طریق دیجی آکادمی' },
                { title: 'به صورت رایگان یک یا چند آموزش را دریافت می کنید.' },
            ],
            authore: {
                caption: 'فروشنده',
                fullName: 'زینب نادری',
                content: '      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنانکه لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع باهدف بهبود ابزارهای کاربردی می باشد،',
            },
            btnCategory: [{ title: 'کتاب الکترونیکی', id: 9 }],
            breadcrumbs: [{
                    type: 'subject',
                    id: 9,
                    title: 'کتاب الکترونیکی',
                },
                {
                    type: 'product',
                    id: 59,
                    title: 'دختری از بروکلین',
                },
            ],
        },
        {
            id: 60,
            name: 'چشم‌هایت',
            englishName: 'your eyes',
            image: 'https://img.ketabrah.ir/img/s/8915335207452450.jpg',
            price: {
                amount: 44000,
                discount_amount: 4000,
                discount_percentage: 7,
                final_amount: 40000,
            },
            bookInfo: [{
                    title: ' حجم',
                    value: '15 مگابایت',
                    icon: 'mdi-arrow-down-circle-outline',
                },
                {
                    title: 'تیراژ',
                    value: 3000,
                    icon: 'mdi-google-analytics',
                },
                {
                    title: ' نوع فایل',
                    value: 'PDF',
                    icon: 'mdi-file-document-outline',
                },
                {
                    title: 'شابک',
                    value: 9786009495535,
                    icon: 'mdi-barcode',
                },
                {
                    title: ' زبان',
                    value: 'فارسی',
                    icon: 'mdi-translate',
                },
                {
                    title: ' تعداد صفحات',
                    value: 159,
                    icon: 'mdi-format-list-bulleted',
                },
                {
                    title: 'سال چاپ',
                    value: 1399,
                    icon: 'mdi-calendar-month-outline',
                },
                {
                    title: 'نویسنده',
                    value: 'سیرسدریک',
                    icon: 'mdi-account',
                },
            ],
            detail: {
                description: '<h3>درباره کتاب چشمهایت (Avec Tes Yeux):</h3> <p> کابوس‌های هولناک و وحشت‌انگیز توما که مدت‌هاست مهمان ناخواندۀ شب‌هایش شده، آرامش را از وی سلب کرده است.توما تصمیم می‌گیرد برای درمان اختلال خوابش به روان‌پزشک مراجعه کند و موضوع را با وی مطرح سازد.روانپزشک دستور یک جلسه هیپنوتیزم برای توما تجویز می‌کند و این جلسه، آغاز ماجراهای عجیب توما بود. </p> <p>سیر سدریک (Cedric Sire) دو داستان را به موازات همدیگر روایت می‌کند، ابتدا دو شخصیت هیچ ارتباطی به یکدیگر ندارند و رفته رفته حادثه‌ای که برای توما پیش آمده است، سرنوشت آن‌ها را به هم متصل می‌کند. نتیجه جلسۀ هیپنوتیزم توما، رسیدن به بصیرتی باورنکردنی و افسانه‌ای بود! او اکنون می‌تواند بسیاری از حوادث را با چشمان غیرفیزیکی ببیند. موضوعی که برایش به دردسری آزاردهنده‌تر از آن کابوس‌های شبانه بدل شده است.</p> <p> توما که اکنون چشمی معنوی و ورای حواس پنج‌گانه دارد، خود را در کالبد یک قاتل روانی می‌بیند که زنی را شکنجه می‌دهد.او سراسیمه به محلی که در ذهنش آن زن را دیده بود می‌رود و تمام تلاشش را برای حفظ جان او می‌کند اما... </p><h3>بخشی از کتاب</h3> <p> توما التماس‌کنان این را می‌گوید؛ آن هم درحالی‌که به زن جوان نزدیک می‌شود.دلش می‌خواهد مسیر قدم‌هایش را تغییر دهد، ولی نمی‌تواند.کاری از دستانش ساخته نیست.برای هرچه بیشتر ترساندن آن زن، می‌کوشد چاقو را در دستانش تکان دهد و با آن بازی کند.چاقویی که در دست دارد تیز و مخصوص است.مخصوص کارهای تمیز و با دقت. </p><p>زن جوان تلاش می‌کند از زیر پارچه‌ای که دهانش را بسته ، فریاد بزند. دقیقاً می‌داند توما قصد انجام دادن چه کاری را دارد. چتری موهای آغشته به خونش بر روی صورتش ریخته.</p> <p> بسه، صبرکن، تو رو خدا دست نگه‌دار! </p><p>برعکس، توما دست برنمی‌دارد. موهای زن را می‌گیرد و سرش را به‌شدت به دیوار می‌کوبد. این کار باعث می‌شود وی گیج شده و دست از تقلا بردارد. اشک می‌ریزد و توما به ناتوانی‌اش نگاه می‌کند.</p> <p> بسه لعنتی!بسه دیگه </p><p>یک‌بار دیگر می‌کوشد خودش را از این صحنه بیرون بیاورد، ولی موفق نمی‌شود. هیچ کاری از دستش بر نمی‌آید. مصمم، چاقو را بالا می‌آورد و آن را به سمت صورت زن می‌برد. خیلی خوب می‌داند چه می‌خواهد. آن چشم‌ها را...</p> <p> دیگر از دست هیچ‌کس کاری بر‌نمی‌آید... </p>',
                avgRating: 1,
                ratingHistogram: [
                    { rate: 5, amount: 0, value: 100 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                    { rate: 0, amount: 0, value: 0 },
                ],
                reviewInfo: [{
                        title: 'تعداد دیدگاه : ',
                        amount: 1,
                    },
                    {
                        title: 'امتیاز کلی :',
                        amount: 1,
                    },
                    {
                        title: 'پیشنهاد شده توسط :  ',
                        amount: '1کاربر',
                    },
                ],
                comments: [{
                    fullName: 'لاله',
                    publishedDate: '2 آبان 1400',
                    courseIdea: [
                        { amount: 40, title: 'موافقم' },
                        { amount: 10, title: 'مخالفم' },
                    ],
                    content: 'کتابی بود که با خوندنش احساس میکردم یه نفر داره منو شکنجه میده و بدتر از همه اینکه این شکنجه تقریباً تو تمام کتاب همراهته.. با خوندنش حس میکردم تو یه جهنم واقعی گیر افتادم.. همش از خودم میپرسیدم نویسنده این کتاب چجور آدمیه که میتونه این صحنه‌ها رو خلق کنه.. ولی حس کنجکاوی که میخوای بدونی قاتل کیه و آخرش چی میشه باعث میشه تا آخرشو بخونی',
                }, ],
                tabs: [{
                        tab: 'توضیحات',
                        icon: 'mdi-sticker-text-outline',
                    },
                    { tab: 'نظرات', icon: 'mdi-comment-text-outline' },
                ],
            },
            emogyRate: {
                emojes: [
                    { name: 'mdi-emoticon-sad-outline', color: 'grey' },
                    { name: 'mdi-emoticon-confused-outline', color: 'grey' },
                    { name: 'mdi-emoticon-neutral-outline', color: 'grey' },
                    { name: 'mdi-emoticon-happy-outline', color: 'grey' },
                    { name: 'mdi-emoticon-outline', color: '#00B0FF' },
                ],
                rate: { vote: 1, score: 0 },
            },
            benefits: [
                { title: 'دسترسی به فایل محصول به صورت مادام‌العمر' },
                { title: 'تضمین کیفیت آموزش ها' },
                { title: 'فعال‌سازی آنی لینک دانلود، پس از ثبت سفارش' },
                { title: 'فروش فقط از طریق دیجی آکادمی' },
                { title: 'به صورت رایگان یک یا چند آموزش را دریافت می کنید.' },
            ],
            authore: {
                caption: 'فروشنده',
                fullName: 'زینب نادری',
                content: '      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنانکه لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع باهدف بهبود ابزارهای کاربردی می باشد،',
            },
            btnCategory: [{ title: 'کتاب الکترونیکی', id: 9 }],
            breadcrumbs: [{
                    type: 'subject',
                    id: 9,
                    title: 'کتاب الکترونیکی',
                },
                {
                    type: 'product',
                    id: 60,
                    title: 'چشم‌هایت',
                },
            ],
        },
    ],
}
mock.onGet('/ebooks').reply((config) => {
    if (config.params.id) {
        return [200, data.eBooks[config.params.id - 50]]
    }
})
mock.onGet('/ebooks/all').reply((config) => {
    return [200, data.eBooks]
})