import mock from '@/@fake-db/mock'
const data = {
    blogs: [{
            id: 1,
            image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/asmbely-min.png',
            video: 'https://dl.mahdisweb.net/videos/exmaple-video.mp4',
            icon: ' mdi-play-circle-outline',
            title: 'زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
            subTitle: '  زبان اسمبلی یک زبان برنامه‌نویسی سطح پایین (Low-level Programming Language)',
            publishedDate: '18 مهر 1398',
            category: { id: 1, type: 'وبلاگ' },
            description: '<p>زبان اسمبلی یک زبان برنامه‌نویسی سطح پایین (Low-level Programming Language) است که دستوراتش معادل کدهای ماشین (Machine Code) هستند. به عبارت دیگر، مجموعه‌ای از دستورات باینری (Binary) که مقادیری را به داخل رجیسترهای CPU (یا ریزپردازنده‌های دیگر) می‌ریزند یا از آن برمی‌دارند.</p><h3><span id="i" class="ez-toc-section">مقدمه</span></h3><p>یک ریزپردازنده، یک ماشین حساب مکانیکی است. یک ریزپردازنده تعدادی رجیستر (Register) مشخص دارد که می‌توانیم آنها را مکانی برای نگهداری اعداد در نظر بگیریم.&nbsp;دستورات به صورت کدهای ماشین به یک ریزپردازنده داده می‌شوند. هر دستور به صورت مجموعه‌ای از بیت‌های باینری نمایش داده می‌شود (مجموعه‌ای از ۰ و ۱ها).&nbsp;برای مثال، در زیر یک خط کد ماشین می‌بینید:</p><p>چند بیت اول (۱۰۱۱۰) دستور کپی کردن یک مقدار در یک رجیستر است.&nbsp; سه رقم دیگر (۰۰۰) رجیستری را مشخص می‌کنند که می‌خواهیم مقدار را در آن کپی کنیم. بقیه‌ی ارقام (۰۱۱۰۰۰۰۱)، مقداری را نشان می‌دهند که می‌خواهیم کپی کنیم.</p><p>البته ۱۰۱۱۰ بی‌معناست و کامپیوتر “نمی‌داند” که این ارقام در واقع می‌گویند “این مقدار را کپی کن”. پردازنده به گونه‌ای طراحی می‌شود که مجموعه‌ای از پالس‌های الکتریکی، که ۱۰۱۱۰ تعیین می‌کند (وصل، قطع، وصل، وصل، قطع)، نتیجه‌ی موردنظر را به ما بدهد. به همین دلیل از کلمه‌ی “مکانیکی” استفاده می‌شود.</p><p>حالا تصور کنید که می‌خواهید دستوری برای پردازنده بنویسید. خیلی راحت می‌توانید ببینید که&nbsp;نوشتن هزاران خط ۰ و ۱ می‌تواند چقدر خسته‌کننده و پر از خطا باشد. راه‌حل این مشکل، زبان برنامه نویسی اسمبلی است.&nbsp;زبان اسمبلی جایگزین‌هایی را برای کدهای طولانی باینری در نظر می‌گیرد که برای انسان قابل فهمند.</p><h3><span id="i-2" class="ez-toc-section">مثال</span></h3><p>برای مثال، اگر ۱۰۱۱۰ به معنای “مقدار را جابه‌جا کن (Move the Value)” باشد، می‌توانیم آن را کوتاه‌تر کنیم و از دستور MOV استفاده کنیم.</p><p>هم‌چنین می‌توانیم به رجیستر ۰۰۰ نامی بدهیم که یادآوری آن راحت‌تر باشد (در این مورد، نام این رجیستر را AL گذاشتیم).</p><p>در نهایت، می‌توانیم مقدار را به دستگاه اعداد (Numbering System) دیگری ببریم، مثل دسیمال (۹۱) یا هگزادسیمال (۶۱). آن وقت کد بالا به این صورت تغییر می‌کند:</p><p>MOV AL, 61</p><p>وقتی کل برنامه را به این روش نوشتیم، آن وقت assembler می‌تواند هر خط کد را به مشابه باینری مناسب آن تبدیل کند.</p><p>کامپیوترها با اجرای میلیون‌ها دستور کوچک این‌ چنینی در ثانیه کار می‌کنند (محاسبات را انجام می‌دهند، داده‌ها را جابه‌جا یا منتقل می‌کنند).</p><p>دستورات بسیار ساده (مثلاً این مقدار را جابه‌جا کن، آن مقدار را کپی کن، این دو مقدار را با هم جمع بزن و نتیجه را در مکانی ذخیره کن) با هم ترکیب می‌شوند و عمل‌هایی پیچیده می‌سازند. این عمل‌ها در سطوح بالاتر با هم ترکیب می‌شوند و کارهایی را انجام می‌دهند که از دید شما مفهومی مشخص دارند.</p><h3>منابع یادگیری&nbsp;زبان اسمبلی</h3><h3><span id="i-4" class="ez-toc-section">منابع آنلاین</span><h3><h4><span id="i-5" class="ez-toc-section">مراجع</span></h4><ul> <li> لیست دستورات X86: لیستی کامل از دستورات معماری X86، به همراه نکاتی درباره‌ی زمان اضافه شدن هر کدام </li> <li> مرجع دستورات و Opcode برای معماری X86 </li> <li> چیت‌شیت(Cheat Sheet) زبان اسمبلی برای معماری X86 </li> </ul> ',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'بلاگ',
                    path: '/blog',
                },
                { title: 'زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده' },
            ],
            relatedContents: [{
                    id: 3,
                    title: 'توسعه‌دهندگان چه می‌کنند و چقدر درآمد دارند؟ | Stack Overflow',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/programming-in2019-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 4,
                    title: '۱۰ دلیل برای یاد گرفتن زبان پایتون',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/python-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 5,
                    title: 'آموزش گام به گام سی شارپ',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/csharplearn-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },
        {
            id: 2,
            image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/hakari-min.png',
            icon: 'mdi-camera-outline',
            title: 'دیجی آکادمی همکاری خود با مرکز آموزش بازرگانی را کلید زد + گالری تصاویر',
            subTitle: '  اکنون آموزش‌های آنلاین ما در فرانش شامل بخش‌های مختلفی است ...',
            publishedDate: '18 مهر 1398',
            category: { id: 1, type: 'وبلاگ' },
            description: '<img src="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/hakari-min.png" class="rounded-lg" alt="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/hakari-min.png" @error="setAltImg"><p>اکنون آموزش‌های آنلاین ما در فرانش شامل بخش‌های مختلفی است که هرکدام قرار است تا دانش مهارتی گروهی خاص از کاربران ایرانی را توسعه دهد. در بین این بخش‌های مختلف، آموزش‌های حوزه کسب‌وکار، اخیرا بیش از بخش‌های دیگر توانسته نظر کاربران وب فارسی را جذب کند.</p><p>افزایش بازدید و همچنین رشد توسعه دوره‌های آموزشی کسب‌وکار باعث شد تا ما برای حفظ چنین شیب مثبتی، زمینه‌های رشد بیشتر را از طریق همکاری با سازمان‌ها و شرکت‌های معتبر در حوزه کسب‌وکار ادامه دهیم.</p><p>در بین سازمان‌های فعال در زمینه آموزش‌ مهارت‌های کسب‌وکار، «مرکز آموزش بازرگانی» با بیش از ۲۰ سال تجربه مفید در این حوزه را برای پیشبرد اهدافمان در زمینه آموزش‌های مجازی انتخاب کنیم.</p><h2>افزایش دوره‌های تخصصی کسب‌وکار</h2><p>مرکز آموزش بازرگانی که از سال ۷۴ شمسی به عنوان بازوی آموزشی وزارت بازرگانی کار خود را آغاز کرده بود، حالا با ۱۲ نوع دوره آموزشی مانند مجموعه‌های بازاریابی و فروش، بورس و بازار سرمایه، صنعت نمایشگاهی و دیگر علوم حوزه بازرگانی، نقش قابل توجهی را در افزایش دانش فعالان اقتصادی کشورمان ایفا می‌کند.</p><p>این مرکز درحالی یکی از مهم‌ترین گروه‌های فعال در زمینه آموزش‌های تخصصی کسب‌وکار است که جهت افزایش بهره‌وری منابع انسانی در بخش صنعت، معدن و تجارت خدمات ارزشمندی را ارائه کرده است.</p><p>همکاری فرانش و مرکز آموزش بازرگانی هم‌اکنون آغاز شده و به‌زودی شاهد دوره‌های آموزشی تخصصی‌تری در بخش کسب‌وکار خواهیم بود. آموزش‌هایی که بتواند با سود بردن از امکانات و توانمندی‌های فرانش و همچنین دانش تخصصی مرکز آموزش بازرگانی به یادگیری فعالان و علاقه‌مندان حوزه کسب و کار کمک کند.</p>',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'وبلاگ',
                    path: '/blog',
                },
                {
                    title: 'دیجی آکادمی همکاری خود با مرکز آموزش بازرگانی را کلید زد + گالری تصاویر',
                },
            ],
            relatedContents: [{
                    id: 3,
                    title: 'توسعه‌دهندگان چه می‌کنند و چقدر درآمد دارند؟ | Stack Overflow',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/programming-in2019-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 4,
                    title: '۱۰ دلیل برای یاد گرفتن زبان پایتون',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/python-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 5,
                    title: 'آموزش گام به گام سی شارپ',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/csharplearn-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },
        {
            id: 3,
            image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/programming-in2019-min.png',
            icon: 'mdi-file-document-outline',
            title: 'توسعه‌دهندگان چه می‌کنند و چقدر درآمد دارند؟ | Stack Overflow',
            subTitle: 'سایت Stack Overflow در نظرسنجی سالانه‌اش سعی کرده تا ترندهای ...',
            publishedDate: '18 مهر 1398',
            category: { id: 1, type: 'وبلاگ' },
            description: '  <img src="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/programming-in2019-min.png" alt="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/programming-in2019-min.png" class="rounded-lg" @error="setAltImg"><p>سایت Stack Overflow در نظرسنجی سالانه‌اش سعی کرده تا ترندهای برنامه‌نویسی جهان را شناسایی کند. در بخش سوم به این می‌پردازیم که توسعه‌دهندگان چطور کار می‌کنند. بخش دوم دربارهٔ زبان‌ها و فناوری‌های مورد استفادهٔ توسعه‌دهندگان و میزان مصرف کافئین آنها بود، و بخش اول به این می‌پرداخت که اساسا توسعه‌دهنده چطور آدمی است.<br>برای کسانی که کد می‌نویسند چشم‌انداز کاری همیشه در حال تغییر است.انواع جدیدی از توسعه‌دهنده پدیدار می‌شوند.توسعه‌دهنده‌های بیشتری به کار از راه دور مشغول می‌شوند(و در نتیجه به شغل‌های بهتر و درآمد بیشتری می‌رسند.) و بیشتر از اغلب حرفه‌ها از کار خود لذت می‌برند، و این مسئله به وضوح خودش را در این نکته نشان می‌دهد که اغلب توسعه‌دهنده‌ها به صورت تفننی و جانبی هم کدنویسی می‌کنند. </p><h3>اشتغال</h3><p>نوع اشتغال توسعه‌دهندگان<br>برای سومین سال متوالی از میان از۲۴ عنوان توسعه‌دهنده، توسعه‌دهندگان بیشتر از هر چیزی خود را« توسعه‌دهندهٔ تمام‌عیار» یا full - stack دانسته‌اند، یعنی توسعه‌دهنده‌ای که به تمامی لایه‌ها و شاخه‌ها آشنایی دارد و دست‌کم در چند مورد نیز تسلط دارد.در سال‌های اخیر دیده شده که شرکت‌هایی مثل فیسبوک در آگهی‌های استخدام خود به دنبال چنین عنوانی بوده‌اند. </p><h3>توسعه‌دهندگان ریاضیات</h3><p>توسعه‌دهندگان زمینه‌های مرتبط با ریاضیات، آمار، داده، و یادگیری ماشینی<br> با مشاهده رفتار کاربران استک آورفلو در این وبسایت، الگوهایی دربارهٔ انواع جدید و روبه‌رشد توسعه نرم‌افزاری دیده شده است.توسعه‌دهندگان ریاضیات و آمار و یادگیری ماشینی از این دسته هستند.پژوهش داده هم شاخهٔ مرتبطی است که البته کمی جاافتاده‌تر است. </p><h3>صنعت</h3><p>صنعت‌هایی که توسعه‌دهنده‌ها در آنها مشغول به کارند، محصولات نرم‌افزاری، وب سرویس، اینترنت، بانکداری، مالی، مدیا، تبلیغات، سرگرمی و بازی، سلامتی، بیوتک، علوم، آموزش، آکادمیک، ارتباطات، مشاوره، دولتی، پژوهش<br>توسعه‌دهندگان کشورهای توسعه‌یافته احتمال بیشتری دارد که در جایی غیر از قدرت‌های نرم‌افزاری مشغول به کار باشند. </><h3>درآمد برحسب فناوری مورد استفاده</h3><p>درآمد برحسب فناوری مورد استفاده، objective-c, C#, C++, Node.js, SQL, Ruby, Javascript, Java, Python, PHP<br>فناوری‌های نوظهور یا خاص بیشترین درآمد را دارند.همینطور big data و پردازش ابری(cloud computing).این شاید نشانهٔ کمبود متخصصین فناوری‌های خاص یا نوظهور باشد که باعث می‌شود کارفرما برای استخدام این نیروها هزینهٔ بیشتری کند.و می‌تواند به این مسئله هم برگردد که متخصصین این فناوری‌های نوظهور و خاص معمولا توسعه‌دهندگان سطح‌بالا و کارکشته‌ای هستند. </p><p>پردرآمدترین فناوری‌ها، cassandra, F#, Scala, Spark, Rust, Hadoop, Cloud, Redis, Azure, Go, ClojureT کلوژر، هادوپ<br>درآمد بر اساس قدرت خرید <br>درآمد بر اساس قدرت خرید، محاسبه بر اساس تعداد همبرگر دوبل(Big Mac) <br> وقتی بخواهیم کیفیت زندگی را مقایسه کنیم، دیگر دلار و یورو و تومان مهم نیست، همبرگر مهم است.شاخص بیگ مک(Big Mac) اکونومیست نوعی اندازه‌گیریِ برابریِ قدرت خرید است که برای مقایسه ارزش واقعی درآمد در کشورهای مختلف استفاده می‌شود.در این قدرت خرید مردم کشورها بر اساس تعداد همبرگرهای دوبل بیگ مک که سالانه می‌توانند بخرند مقایسه می‌شود. </p><h3>درآمد برحسب دورکاری</h3><p>درآمد توسعه‌دهنده برحسب دورکاری<br> دورکاری جواب می‌دهد!توسعه‌دهنده‌هایی که دورکاری می‌کنند در حدود٪۴۰ بیشتر از کسانی که هرگز دورکاری نمی‌کنند درآمد دارند.این شکاف در کشورهای درحال توسعه بیشتر می‌شود. </p><h3>وضعیت اشتغال توسعه‌دهندگان</h3><p>گر توسعه‌دهنده باشید، بعید است بی‌کار مانده باشید. ٪۹۷.۵ پاسخ‌دهنده‌ها گفته‌اند که دست‌کم به صورت پاره‌وقت شاغل هستند. و حتی شاغلین تمام‌وقت هم از پروژه‌های جانبی دور نمی‌شوند. توسعه‌دهنده‌های شاغل تمام‌وقت به‌طور متوسط هفته‌ای بیشتر از ۶ ساعت صرف پروژه‌های جانبی می‌کنند. توسعه‌دهنده‌های بازنشسته سه برابر این مدت را صرف پروژه‌های جانبی و تفننی می‌کنند. کدنویسی برای خیلی‌ها عشق زندگی‌شان است.</p><h3>رضایت شغلی</h3><p>میزان رضایت شغلی توسعه‌دهنده‌ها<br>٪۷۶توسعه‌دهنده‌ها می‌گویند که از کارشان دست‌کم راضی‌اند، و٪۴۰ می‌گویند عاشق کارشان هستند.به‌طور کلی رضایت شغلی توسعه‌دهنده‌ها از خیلی از مشاغل دیگر بیشتر است. </p><p>و ظاهرا توسعه‌دنده‌های ایرانی هم بیشترین رضایت شغلی را در دنیا دارند!</p><p>رضایت شغلی توسعه‌دهنده بر حسب کشور، ایرانی بالاتری میزان رضایت شغلی<br>رضایت شغلی برحسب شاخهٔ کاری <br> رضایت شغلی برحسب شاخه کاری، مدیر محصول، کنترل کیفیت، هوش تجاری، انبارش داده، برنامه‌نویس گرافیک، یادگیری ماشینی، همراه، مدیر، اجرایی <br>ریاست کردن حس خوبی دارد.رضایت شغلی مدیران٪۱۶ بیشتر از متوسط است.مدیر محصول هم معمولا کمترین رضایت از کارش را دارد. </p><p>رضایت شغلی برحسب شاخه کاری، <span style="color: #3366ff;">مدیر محصول</span>، کنترل کیفیت، هوش تجاری، انبارش داده، برنامه‌نویس گرافیک، یادگیری ماشینی، همراه، مدیر، اجرایی<br>ریاست کردن حس خوبی دارد.رضایت شغلی مدیران٪۱۶ بیشتر از متوسط است.مدیر محصول هم معمولا کمترین رضایت از کارش را دارد. </p>',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'وبلاگ',
                    path: '/blog',
                },
                {
                    title: 'توسعه‌دهندگان چه می‌کنند و چقدر درآمد دارند؟ | Stack Overflow',
                },
            ],
            relatedContents: [{
                    id: 3,
                    title: 'توسعه‌دهندگان چه می‌کنند و چقدر درآمد دارند؟ | Stack Overflow',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/programming-in2019-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 4,
                    title: '۱۰ دلیل برای یاد گرفتن زبان پایتون',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/python-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 5,
                    title: 'آموزش گام به گام سی شارپ',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/csharplearn-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },
        {
            id: 4,
            image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/python-min.png',
            icon: 'mdi-file-document-outline',
            title: '۱۰ دلیل برای یاد گرفتن زبان پایتون',
            subTitle: 'آماده باشید تا عاشق زبان پایتون شوید!! آماده باشید تا ...',
            publishedDate: '18 مهر 1398',
            category: { id: 1, type: 'وبلاگ' },
            description: '   <img src="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/python-min.png" alt="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/python-min.png" class="rounded-lg" @error="setAltImg"><h3>آماده باشید تا عاشق زبان پایتون شوید!!</h2><p>ویژگی‌های مختلفی وجود دارد که باعث می‌شود افراد، پایتون را به عنوان اولین زبان برنامه‌نویسی خود انتخاب کنند. این ویژگی‌ها عبارتند از:</p><ol> <li> <strong> & nbsp;محبوبیت زبان پایتون و کسب درآمد زیاد از طریق آن </strong></li> <li> <strong> & nbsp;استفاده از زبان پایتون در علم داده </strong></li> <li> <strong> & nbsp;اسکریپت و اتوماسیون در پایتون </strong></li> <li> <strong> استفاده از پایتون برای داده‌های بزرگ </strong></li> <li> <strong> پشتیبانی پایتون از تست(Testing) </strong></li><li> <strong> & nbsp;گرافیک کامپیوتری در پایتون </strong></li><li><strong> & nbsp;استفاده از پایتون در هوش مصنوعی </strong></li> <li> <strong> & nbsp;استفاده از پایتون در توسعه وب </strong></li> <li> <strong> & nbsp;سازگار و قابل انتقال بودن </strong></li> <li> <strong> & nbsp;سادگی و یادگیری آسان </strong></li> </ol><p>اگر قصد یاد گرفتن پایتون را دارید و می‌خواهید مهارت‌های مرتبط با آن را بیاموزید؛ اکنون زمان مناسبی برای شروع است. زبان برنامه‌نویسی پایتون یک زبان جدید و نوظهور است و هنوز بازار کار آن در کشورهای مختلف اشباع نشده است. در چنین شرایطی، شما به عنوان یک متخصص زبان پایتون می‌توانید به راحتی شغل پیدا کرده و درآمد زیادی کسب کنید.</p><h3><span id="i" class="ez-toc-section"><strong>۱۰- سادگی و یادگیری آسان</strong></span></h3><p>پایتون، زبانی بسیار آسان و ساده است. این زبان بسیار قدرتمند و نزدیک به زبان انگلیسی است.</p><p>چه چیزی باعث سادگی زبان پایتون می‌شود؟</p><ul> <li> آزاد و اوپن سورس(open source) بودن </li> <li> سطح بالا بودن </li> <li> زبان مفسر(زبانی که اغلب دستورات آن بدون نیاز به کامپایل کردن، توسط مفسر اجرا می‌شود) </li> <li> اجتماع بزرگی از کاربران </li> </ul><h3><span id="i-2" class="ez-toc-section"><strong>۹- سازگار و قابل انتقال بودن</strong></span></h3><p>ویژگی‌های انعطاف‌پذیری و قابل انتقال بودن زبان پایتون به شما اجازه می‌دهد تا بتوانید از این زبان در پلتفرم‌های مختلف استفاده کنید. پایتون توسط اکثر پلتفرم‌های موجود در صنعت، پشتیبانی می‌شود. این زبان روی ویندوز، لینوکس، مکینتاش، سولاریس و… قابل دستیابی است.</p><h3>۸- توسعه وب</h3><p>پایتون، دارای مجموعه‌ای از فریم‌ورک‌ها برای توسعه وبسایت‌ است. فریم‌ورک‌های محبوب پایتون عبارتند از: Django، Flask، Pylons و… . این فریم‌ورک‌ها به شما کمک می‌کنند تا اسکریپت‌ها و کدهای خود را سریع‌تر و آسان‌تر بنویسید. اصلی‌ترین دلیلی که این فریم‌ورک‌ها به زبان پایتون نوشته شده‌اند این است که کدهای آن خیلی سریع‌تر و پایدارتر هستند.</p><p>همچنین می‌توانید سایر صفحات وب که با فریم‌ورک‌های پایتون نوشته شده‌اند را بررسی کرده و از جزئیات به کار رفته در آنها استفاده کنید. سایت‌هایی مثل اینستاگرام، bit bucket و pinterest از این فریم‌ورک‌ها ساخته شده اند.</p><h3>۷- هوش مصنوعی</h3><p>هوش مصنوعی (AI) یک پیشرفت بزرگ در دنیای تکنولوژی است. با استفاده از هوش مصنوعی می‌توانید یک ماشین را مطابق مغز انسان با قدرت تفکر، تجزیه و تحلیل و تصمیم‌گیری طراحی کنید.</p><p>علاوه بر این، کتابخانه‎هایی مانند Keras و TensorFlow قابلیت یادگیری را به ماشین اضافه می‌کنند. با استفاده از این کتابخانه‌ها و بدون اینکه برنامه‎نویسی دقیقی انجام شده باشد، ماشین‌ها قدرت یادگیری پیدا می‎کنند. همچنین کتابخانه‎ایی مانند openCV وجود دارد که به دید کامپیوتر یا تشخیص تصویر کمک می‎کند.</p><h3>۶- گرافیک کامیوتری</h3><p>پایتون معمولا در پروژه‌های بزرگ، کوچک، آنلاین یا آفلاین به کار می‌رود. از پایتون برای ساخت رابط کاربری گرافیکی (GUI) و برنامه‎های دسکتاپ استفاده می‌شود. برای این کار از کتابخانه Tkinter استفاده می‌کنیم تا راهی سریع و آسان برای ایجاد برنامه‎های کاربردی فراهم شود.</p><p>این کتابخانه در توسعه بازی‌ها نیز استفاده می‌شود. همچنین می‎توانید با استفاده از آن، منطق استفاده از ماژول “pygame” که در دستگاه‌های اندروید اجرا می‌شوند را بنویسید.</p><h3>۵- فریم‌ورک تست</h3><p>زبان پایتون برای تست کردن و راستی آزمایی تولیدات کمپانی‌ها بسیار مفید است. پایتون، فریم‌ورک‌هایی برای تست کردن برنامه‌ها دارد که با استفاده از این فریم‌ورک‌ها می‌توان نرم‌افزارها را دیباگ کرد. کمک گرفتن از زبان پایتون، سریع‌ترین راهی است که می‌تواند به رفع باگ برنامه‌ها منتهی شود. این زبان دارای تعداد زیادی ابزار و ماژول برای راحت‌تر کردن برنامه‌نویسی است. Selenium و Splinter دو نمونه از این ماژول‌ها هستند.</p><p>همچنین زبان پایتون، تست کردن بین پلتفرم‌ها و مرورگرها را از طریق فریم‎ورک های PyTest و Robot Framework ممکن می‌کند. تست کردن و راستی آزمایی، یک کار بسیار حساس و دقیق است و زبان پایتون سرعت این کار حساس را بیشتر می‌کند. بر اساس این دلایل، هر تست کننده نرم‌افزار قطعا باید از پایتون استفاده کند.</p><h3>۴- استفاده از پایتون برای داده‌های بزرگ</h3><p>پایتون بسیاری از مشکلات داده‌ها را برطرف می‌کند. می‌توانید از Hadoop در پایتون برای محاسبات موازی استفاده کنید. شما در پایتون یک کتابخانه به نام “Pydoop” دارید و می‎توانید یک برنامه MapReduce را در پایتون بنویسید و اطلاعات موجود در دسته HDFS را پردازش کنید.</p><p>کتابخانه‌های دیگری مثل “Dask” و “Pyspark” برای پردازش داده‌های بزرگ وجود دارد. بنابراین، پایتون به شکل گسترده‌ای برای داده‌های بزرگ استفاده می‌شود زیرا به راحتی می‌تواند آنها را پردازش کند.</p><h3>۱- محبوبیت پایتون و کسب درآمد بالا</h3><p>متخصصین پایتون یکی از بالاترین درآمدها را در صنعت IT دارند. میانگین حقوق و دستمزد یک توسعه‌دهنده پایتون در ایلات متحده آمریکا، حدود ۱۱۶ هزار دلار در سال است.</p> ',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'وبلاگ',
                    path: '/blog',
                },
                { title: '۱۰ دلیل برای یاد گرفتن زبان پایتون' },
            ],
            relatedContents: [{
                    id: 3,
                    title: 'توسعه‌دهندگان چه می‌کنند و چقدر درآمد دارند؟ | Stack Overflow',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/programming-in2019-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 4,
                    title: '۱۰ دلیل برای یاد گرفتن زبان پایتون',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/python-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 5,
                    title: 'آموزش گام به گام سی شارپ',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/csharplearn-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },
        {
            id: 5,
            image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/csharplearn-min.png',
            icon: 'mdi-file-document-outline',
            title: 'آموزش گام به گام سی شارپ',
            subTitle: '  ۱.نگاهی به C# C# یک زبان برنامه‌نویسی شی گرا، ساده ...',
            publishedDate: '18 مهر 1398',
            category: { id: 1, type: 'وبلاگ' },
            description: ' <img src="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/csharplearn-min.png" class="rounded-lg" alt="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/csharplearn-min.png" @error="setAltImg"> <h3> ۱.نگاهی به C# </h3><p>C# یک زبان برنامه‌نویسی شی گرا، ساده و مدرن است که توسط شرکت Microsoft عرضه شده است. .NET Foundation این پروژه‌ی متن‌باز (Open Source) را مدیریت می‌کند.<br> C# یک زبان برنامه‌نویسی شی گرا و کامل است که به برنامه‌نویسان این امکان را می‌دهد اپلیکیشن‌هایی کراس‌پلفترم(cross - platform) برای پلتفرم‌های ویندوز، تحت وب و موبایل بنویسند.می‌توانیم برنامه‌های C# را در سیستم‌عامل‌های لینوکس، ویندوز، iOS و اندروید بنویسیم. </p> <p> C# یک زبان برنامه‌نویسی مدرن است.می توانیم از آن برای نوشتن برنامه‌های نرم‌افزاری مدرن امروزی استفاده کنیم. <br> از C# می‌توانیم برای توسعه‌ی انواع مختلف اپلیکیشن‌ها استفاده کنیم: برنامه‌های کلاینت ویندوز، کامپوننت‌ها(component) و کتابخانه‌ها(library)، سرویس‌ها(service) و APIها، اپلیکیشن‌های تحت وب، برنامه‌های موبایل، اپلیکیشن‌های ابری و بازی‌های ویدیوئی. </p><p>Microsoft از دو فریمورک توسعه‌ی نرم‌افزار پشتیبانی می‌کند، فریمورک .NET و .NET Core. فریمورک .NET برای توسعه‌ی اپلیکیشن‌های ویندوز و تحت وب در سال ۲۰۰۱ منتشر شد.<br> اما با فراگیر شدن مفهوم متن‌باز، شرکت Microsoft نیز کامپایلرهای زبان و.NET را متن‌باز کرد و این.NET جدید.NET Core نامیده می‌شود. <br >در آینده تنها یک نسخه از.NET وجود خواهد داشت، که همان.NET خواهد بود.نسخه‌ی بعدی.NET در سال۲۰۲۰ و با نام.NET 5 منتشر خواهد شد. </p> <h3> ۲.آمادگی برای شروع آموزش سی شارپ </h3><p>قبل از اینکه اولین اپلیکیشن C# را شروع کنید، باید یک ویرایشگر متن (Editor) یا محیط یکپارچه‌ی توسعه‌ی نرم‌‌افزار (IDE) داشته باشید، که بتوانید در آن کدهایتان را بنویسید و کامپایل کنید.<br>بهترین IDE موجود برای برنامه‌نویسان C#، Visual Studio شرکت Microsoft است.نسخه‌ی کنونی آن Visual Studio 2019 است. </p > <p> Visual Studio 2019 به سه صورت مختلف عرضه می‌شود: Visual Studio 2019 Enterprise، Visual Studio 2019 Professional و Visual Studio 2019 Community </p><p>Visual Studio 2019 Community رایگان است. در این آموزش از Visual Studio 2017 Community استفاده خواهیم کرد.<br>همین‌طور می‌توانید از Visual Studio Code هم استفاده کنید. <br>Visual Studio Code یک ویرایشگر کدِ رایگان، سبک و متن باز است که می‌توانید از آن برای نوشتن و دیباگ کردن(Debug) کدهایتان استفاده کنید.VS Code از بیشتر زبان‌های برنامه‌نویسی پشتیبانی می‌کند. </p> <h3> ۳.تفاوت IDE، زبان و فریمورک </h3><p>قبل از نوشتن اولین برنامه، می‌خواهیم تفاوت‌های IDE، زبان برنامه‌نویسی و فریمورک را بررسی کنیم. نمی‌توانیم C#، .NET و ویژوال استودیو (Visual Studio) را یکی درنظر بگیریم، چون با هم فرق دارند.</p> <p> ویژوال استودیو(Visual Studio) یک IDE(محیط یکپارچه‌ی توسعه‌ی نرم‌افزار) است، C# و VB.NET زبان‌های برنامه‌نویسی هستند و.NET یک فریمورک است. </p><p>فریمورک .NET مجموعه‌ای عظیم از کامپوننت‌ها و کتابخانه‌هاست. اگر به آدرس زیر در سیستم‌تان بروید:</p> <p> C: WindowsMicrosoft.NETFramework </p><p>نسخه‌هایی مختلف از&nbsp;فریمورک .NET را خواهید دید. اگر به هریک از پوشه‌های مربوط به نسخه‌های.NET بروید، فایل‌های مختلفی را می‌بینید که با کلمه‌ی “System” شروع می‌شوند و از نوع “Dll” هستند.</p> <p> DLL مخفف کلمه‌ی Dynamic Link Library است. </p><p>این فایل‌ها دارای کدهایی با قابلیت استفاده‌ی مجدد (reusable code&nbsp;) هستند که کاری خاص را انجام می‌دهند.<br>مثلاً، فایل“ System.Data.dll” به ذخیره‌ی داده در & nbsp;RDBMS & nbsp;کمک می‌کند یا فایل“ System.Drawing.Dll” & nbsp;برای اهداف GUI(واسط کاربری گرافیکی) و نمایش است. </p> <p> پس به زبانی ساده، فریمورک.NET مجموعه‌ای بزرگ از کامپوننت‌هایی با قابلیت استفاده‌ی مجدد است. </p><p>حالا برای نوشتن یک برنامه، باید منطق برنامه را بنویسیم و این کامپوننت‌ها را فراخوانی کنیم.<br>برای این کار به زبان برنامه‌نویسی نیاز داریم.C# و VB.NET زبان‌های برنامه‌نویسی هستند.این زبان‌ها می‌توانند این کامپوننت‌ها را فراخوانی و از آنها استفاده کنند. </p> <p> در اپلیکیشن‌های حرفه‌ای، سایز برنامه بسیار بزرگ است و برای مدیریت بهتر اتوماسیون موارد زیر لازم است: </p><ul> <li> پیدا کردن و ارجاع به کامپوننت فریمورک.NET در کد C# </li> <li> کمک به پشتیبانی از کامپوننت‌های.NET در زمان کدنویسی </li> <li> چک کردن سینتکس C# و کامپایل آن </li> </ul><p>به طور خلاصه، ابزاری لازم داریم که در مدیریت کد C# و ارجاع کامپوننت‌های فریمورک .NET در شرایط مختلف کمک‌مان کند. می‌توانیم این ابزار را یک محیط یکپارچه‌ی توسعه‌ی نرم‌افزار بنامیم. (VS IDE (Visual Studio IDE تمامی این کارها را برایمان انجام می‌دهد.</p> <p> طور خلاصه، C# یک زبان برنامه‌نویسی است و از کامپوننت‌های فریمورک.NET برای نوشتن یک اپلیکیشن استفاده می‌کند. <br> برای توسعه‌ی یک نرم‌افزار، باید کارهایی را انجام دهیم، مثلاً کامپایل کردن برنامه، ارجاع به کامپوننت‌های فریمورک.NET، چک کردن سینتکس و غیره، که VS IDE همه‌ی این کارها را انجام می‌دهد.پس VS IDE یک ابزار است. </p> ',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'وبلاگ',
                    path: '/blog',
                },
                { title: 'آموزش گام به گام سی شارپ' },
            ],
            relatedContents: [{
                    id: 3,
                    title: 'توسعه‌دهندگان چه می‌کنند و چقدر درآمد دارند؟ | Stack Overflow',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/programming-in2019-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 4,
                    title: '۱۰ دلیل برای یاد گرفتن زبان پایتون',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/python-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 5,
                    title: 'آموزش گام به گام سی شارپ',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/csharplearn-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },
        {
            id: 6,
            image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/sql-learning-min-522x295.png',
            icon: 'mdi-camera',
            title: 'آموزش SQL برای مبتدی‌ها',
            subTitle: '    در دنیای فناوری صحبت‌های بسیاری در مورد داده شنیده می‌شود، اما داده خام به خودی خود بسیار سودمند نخواهد بود. SQL (معمولاً مانند کلمه «sequel» تلفظ می‌شود) مخفف «زبان پرسمان تنظیم شده» یا Structured Query Language است. آموزش ...',
            publishedDate: '18 مهر 1398',
            category: { id: 1, type: 'وبلاگ' },
            description: ' <img src="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/sql-learning-min-522x295.png" alt="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/sql-learning-min-522x295.png" class="rounded-lg" @error="setAltImg"><p>در دنیای فناوری صحبت‌های بسیاری در مورد داده شنیده می‌شود، اما داده خام به خودی خود بسیار سودمند نخواهد بود. SQL (معمولاً مانند کلمه «sequel» تلفظ می‌شود) مخفف «زبان پرسمان تنظیم شده» یا Structured Query Language است. آموزش SQL امکان ارتباط با پایگاه داده برای مدیریت همه‌ی داده‌های موجود را فراهم می‌کند و SQL زبانی است که کوتاه‌ترین توضیح برای نسخه‌ای طولانی راهنمای پیش‌رو است.ادامه راهنمای آموزش SQL را بخوانید. در این مقاله توضیح می‌دهیم که SQL چیست، مقدمات یادگیری SQL چیست؟ چه صنایعی که بیشتر از آن استفاده می‌کنند؟ همچنین سیستم‌های رایج SQL و نحوه‌‌ی شروع یادگیری خود زبان را توضیح می‌دهیم. این روزها، تقریباً همه‌ی کسب‌و‌کارها از مغازه‌های کوچک آنلاین گرفته تا شرکت‌های فورچون ۵۰۰ از داده برای انجام فعالیت‌های خود استفاده می‌کنند.آن‌ها این داده را با استفاده از پایگاه‌های داده مدیریت می‌کند. به این منظور، تقاضا برای متخصصان مدیریت پایگاه داده به شدت افزایش یافته است و در نتیجه، فعالیت به عنوان توسعه‌دهنده پایگاه داده، به ویژه، توسعه‌دهنده SQL، بسیار سودآور خواهد بود.</p><h3>SQL چیست؟</h3> <p> داده بخش اصلی بسیاری از برنامه‌های موبایل و برنامه‌های وب است.برای مثال، برنامه‌ای مانند فیسبوک اطلاعات پروفایل کاربر از جمله داده دوستان و پست‌های آن‌ها را حفظ می‌کند.برای حفظ این داده، سیستم پایگاه داده مورد استفاده قرار می‌گیرد.SQL(زبان پرسمان سازمان‌یافته) زبان برنامه‌نویسی است که برنامه‌نویس را قادر می‌سازد تا با آن داده‌ها کار کند.در حالی که ممکن است برنامه به زبان پایتون، PHP یا روبی(Ruby) برنامه‌نویسی شده باشد، پایگاه‌های داده طوری سازماندهی نشدند که این زبان‌ها را بشناسند. </p> <p>از نظر تاریخی، پایگاه‌های داده تنها SQL را می‌شناسد (گرچه این مسئله در سال‌های اخیر تغییرات بسیاری کرده است). به این خاطر، اگر بخواهید در توسعه وب یا توسعه برنامه کار کنید، یادگیری SQL تقریباً ضروری است.</p> <p> مانند زبان‌های برنامه‌نویسی دیگر، SQL نشانه‌گذاری(markup) خود را دارد.این مسئله یادگیری نشانه‌گذاری SQL قبل از استفاده مؤثر از آن‌ توسط برنامه‌نویس را ضروری می‌سازد. </p> <h3>یادگیری فرمان ها و دستورهای Command SQL</h3> <p> فرمان‌های command SQL کمتر استفاده شده‌ای وجود دارند که برای کار با پایگاه داده باید با آن‌ها آشنایی داشته باشید.زمانی که با پایگاه‌های داده کار می‌کنید، برنامه‌نویس فرمان‌های زیر را می‌نویسد: </p>  <p>CEATE DATABASE ـ برای ایجاد پایگاه دادهCREATE TABLE ـ برای ایجاد جداولSELECT ـ برای یافتن/ استخراج برخی داده از پایگاه دادهUPDATE ـ انجام تنظیمات و ویرایش دادهDELETE ـ برای حذف داده</p> <p>تنها فرمان‌های (command) بسیار رایجی وجود دارند. هرچه پایگاه داده پیچیده‌تر باشد، شما به عنوان برنامه‌نویس باید از فرمان‌های بیشتر استفاده کنید.</p>  <p>  این فرمان‌ها در زمان نوشتن سؤالات ـ پرسش‌ها به کار می‌روند که به شما این امکان را می‌دهند تا داده را در پایگاه داده مدیریت کنید. به عبارت دیگر، زمانی که به این فرمان‌ها در سیستم پایگاه داده وارد می‌شوید، سیستم فرمان‌ها را تفسیر می‌کند و آن‌ها را پردازش می‌کند. برای مثال، نتیجه، رکورد جدید در پایگاه داده یا ایجاد پایگاه داده جدید خواهد بود.این فرمان‌ها در زمان نوشتن سؤالات ـ پرسش‌ها به کار می‌روند که به شما این امکان را می‌دهند تا داده را در پایگاه داده مدیریت کنید.به عبارت دیگر، زمانی که به این فرمان‌ها در سیستم پایگاه داده وارد می‌شوید، سیستم فرمان‌ها را تفسیر می‌کند و آن‌ها را پردازش می‌کند.برای مثال، نتیجه، رکورد جدید در پایگاه داده یا ایجاد پایگاه داده جدید خواهد بود. </p>',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'وبلاگ',
                    path: '/blog',
                },
                { title: 'آموزش SQL برای مبتدی‌ها' },
            ],
            relatedContents: [{
                    id: 3,
                    title: 'توسعه‌دهندگان چه می‌کنند و چقدر درآمد دارند؟ | Stack Overflow',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/programming-in2019-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 4,
                    title: '۱۰ دلیل برای یاد گرفتن زبان پایتون',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/python-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 5,
                    title: 'آموزش گام به گام سی شارپ',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/csharplearn-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },
        {
            id: 7,
            image: 'https://files.virgool.io/upload/users/210308/posts/tuuckw3cb15l/1t2thl7xifgc.jpeg',
            icon: 'mdi-camera',
            title: 'آموزش لاراول Laravel گام به گام پروژه محور ۲۰۱۹',
            subTitle: ' موضوع این مقاله، آموزش لاراول Laravel گام به گام پروژه محور ۲۰۱۹ است. در این مثال، از انواع مختلف ورودی‌ها مانند دکمه‌ی رادیویی، checkbox و select box استفاده کرده‌ایم. عملیات CRUD در لاراول بسیار پراهمیت هستند، در عین حال انواع ...',
            publishedDate: '18 مهر 1398',
            category: { id: 1, type: 'وبلاگ' },
            description: ' <img src="https://files.virgool.io/upload/users/210308/posts/tuuckw3cb15l/1t2thl7xifgc.jpeg" class="rounded-lg" alt="https://files.virgool.io/upload/users/210308/posts/tuuckw3cb15l/1t2thl7xifgc.jpeg" @error="setAltImg"><p>موضوع این مقاله، آموزش لاراول Laravel گام به گام پروژه محور ۲۰۱۹ است. در این مثال، از انواع مختلف ورودی‌ها مانند دکمه‌ی رادیویی، checkbox و select box استفاده کرده‌ایم. عملیات CRUD در لاراول بسیار پراهمیت هستند، در عین حال انواع ورودی‌های بسیار متنوعی دارند. در این مثال، از لاراول با نسخه‌ی ۵.۵ استفاده کرده‌ایم. داده‌ها را در دیتابیس MySQL ایجاد می‌کنیم، می‌خوانیم و آپدیت می‌کنیم. اگر در کار با لاراول مبتدی هستید، ممکن است این نوشته برای شما سودمند باشد.</p><h2>پیش‌نیازهای نصب</h2><ul> <li> PHP با نسخه‌ی۷.۰.۰یا بالاتر </li> <li> OpenSSL PHP Extension </li> <li> PDO PHP Extension </li> <li> Mbstring PHP Extension </li> <li> Tokenizer PHP Extension </li> <li> XML PHP Extension </li> </ul><h2>آموزش پروژه صفر تا صد لاراول Laravel در سطح مقدماتی</h2><h4>&nbsp;مرحله‌ی اول: نصب فریمورک لاراول</h4><pre><code class="php">composer create - project--prefer - dist laravel / laravel coins </code> </pre><p>با نصب لاراول یک سلسله مرتبه (Hierarchy) به وجود آمده و تمام موارد مربوط به لاراول نیز نصب خواهند شد.</p> ',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'وبلاگ',
                    path: '/blog',
                },
                { title: 'آموزش لاراول Laravel گام به گام پروژه محور ۲۰۱۹' },
            ],
            relatedContents: [{
                    id: 3,
                    title: 'توسعه‌دهندگان چه می‌کنند و چقدر درآمد دارند؟ | Stack Overflow',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/programming-in2019-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 4,
                    title: '۱۰ دلیل برای یاد گرفتن زبان پایتون',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/python-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 5,
                    title: 'آموزش گام به گام سی شارپ',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/csharplearn-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },
        {
            id: 8,
            image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/angualr-min-522x295.png',
            video: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/motion-graphic-12.mp4?_=1',
            icon: 'mdi-camera',
            title: 'مزایا و معایب ۸ Angular',
            subTitle: '   مزایا و ویژگی‌های Angular 8 انگولار ۸ مزایایی دارد که در ادامه عنوان می­شوند: نوشتن کد در آن ساده است. سرعت بالا فریمورک انگولار روتینگ (Routing) را مدیریت می­‌کند. در این صورت رفتن از یک view به view دیگر در ...',
            publishedDate: '18 مهر 1398',
            category: { id: 1, type: 'وبلاگ' },
            description: '<h2>مزایا و ویژگی‌های Angular 8</h2><h4>انگولار ۸ مزایایی دارد که در ادامه عنوان می­شوند:</h4><ul><li> نوشتن کد در آن ساده است. </li> <li> سرعت بالا </li> <li> فریمورک انگولار روتینگ(Routing) را مدیریت می­‌ کند.در این صورت رفتن از یک view به view دیگر در انگولار ساده است. </li> <li> آپدیت­ های بدون­ وقفه با استفاده از Angular CLI(واسط دستوری) </li><li> امکان گرفتن وضعیت سرویس­‌ های مکانی(Location Service) را می­ دهد. </li> <li> در انگولار۸ می­ توانیم templateها را دی­ باگ کنیم.از چند برنامه در یک دامین پشتیبانی می­ کند. </li> </ul><p>&nbsp;</p><p style="text-align: center;"><img src="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/picss.jpg"></p><p>&nbsp;</p><h2>معایب Angular 8</h2><h4>انگولار ۸ معایبی دارد که در ادامه بیان می­‌شوند:</h4><ul> <li> ویژگی­‌ های انگولار می­‌ تواند برای مبتدی­‌ ها گیج‌­ کننده باشد. </li> <li>li> منحنی یادگیری عمیق </li> <li> دی­ باگ scopeها مشکل است.روتینگ محدود. </li> <li> وقتی صفحات دارای المنت­‌ های تعاملی هستند، سرعت Angular کم می­‌ شود. </li> <li> افزودن کتابخانه­ شخص‌­ سوم پیچیده است. </li> <li> در ارتقاء از ورژن­‌ های قدیمی به جدیدتر به مشکلات متعددی برمی­‌ خوریم. </li> </ul> ',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'وبلاگ',
                    path: '/blog',
                },
                { title: 'مزایا و معایب ۸ Angular' },
            ],
            relatedContents: [{
                    id: 3,
                    title: 'توسعه‌دهندگان چه می‌کنند و چقدر درآمد دارند؟ | Stack Overflow',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/programming-in2019-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 4,
                    title: '۱۰ دلیل برای یاد گرفتن زبان پایتون',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/python-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 5,
                    title: 'آموزش گام به گام سی شارپ',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/csharplearn-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },

        {
            id: 9,
            image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/Untitleuud-1-min-522x295.png',
            icon: 'mdi-camera',
            title: 'استارتاپ یونیکورن چیست؟ | آیا در ایران استارتاپ یونیکورن داریم؟',
            subTitle: 'اصطلاح یونیکورن اولین بار در سال 2013 توسط آیلین لی استفاده شد و به شرکت‌هایی که بعد از سال 2003 ایجادشده‌اند و ارزش فعلی آن‌ها بیش از یک میلیارد دلار است، گفته می‌شود. در معنی لغوی واژه یونیکورن به معنای ...',
            publishedDate: '18 مهر 1398',
            category: { id: 1, type: 'وبلاگ' },
            description: ' <img src="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/Untitleuud-1-min-522x295.png" alt="https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/Untitleuud-1-min-522x295.png" class="rounded-lg" @error="setAltImg"><p>اصطلاح یونیکورن اولین بار در سال 2013 توسط آیلین لی استفاده شد و به شرکت‌هایی که بعد از سال 2003 ایجادشده‌اند و ارزش فعلی آن‌ها بیش از یک میلیارد دلار است، گفته می‌شود. در معنی لغوی واژه یونیکورن به معنای اسب تک‌شاخ است. تک‌شاخ‌ها موجودات افسانه‌ای هستند که یک‌شاخ در سرشان دارند.</p><p>اصطلاح یونیکورن اولین بار در سال 2013 توسط آیلین لی استفاده شد و به شرکت‌هایی که بعد از سال 2003 ایجادشده‌اند و ارزش فعلی آن‌ها بیش از یک میلیارد دلار است، گفته می‌شود. در معنی لغوی واژه یونیکورن به معنای اسب تک‌شاخ است. تک‌شاخ‌ها موجودات افسانه‌ای هستند که یک‌شاخ در سرشان دارند. استارتاپ‌هایی که&nbsp; خیلی زود به ارزش بالای 1 میلیارد دلاررسیده‌اند و مانند اسب تک‌شاخ به یک افسانه تبدیل شده‌اند</p><p>آیلین لی برای اولین بار در مقاله‌ی خود “به باشگاه یونیکورن خوش‌آمدید: آشنایی با استارتاپ‌های یک میلیارد دلاری” درباره یونیکورن در جهان سرمایه‌داری نوشت. در این مقاله، او در مورد استارتاپ‌هایی که از سال 2000 به بعد ایجادشده‌اند نوشت و برآورد کرد که تنها 0.07 درصد از آن‌ها تاکنون به ارزش 1 میلیارد دلار رسیده‌اند. وی خاطرنشان کرد که استارتاپ‌هایی که موفق به رسیدن به ارزش 1 میلیارد دلار شدند، بسیار نادر هستند و پیدا کردن آن‌ها مانند پیدا کردن یک اسب تک‌شاخ اسطوره‌ای است.</p><p>البته به‌جز اصطلاح یونیکورن، اصطلاحات دیگری هم برای توصیف اندازه‌ی یک شرکت استارتاپی به کار می‌رود، به شرکت‌هایی که ارزش آن‌ها بالای 10 میلیارد دلار است دکاکورن (decacorn) و به شرکت‌هایی که بالای 100 میلیون دلار ارزش‌دارند هکتوکورن (hectocorn) گفته می‌شود. Uber، Dropbox، SpaceX، WeWork و … برخی از Decacorns مشهور هستند.</p><p><strong>چه تعداد استارتاپ یونیکورن در جهان وجود دارد؟</strong></p><p>TechCrunch می‌گوید که تا مارس 2018، 279 شرکت یونیکورن وجود داشت. بزرگ‌ترین یونیکورن‌ها در سال 2018 عبارت‌اند از Uber، Airbnb، Palantir، Pinterest و Xiaomi. در ماه مارس 2018 هم اعلام شد که ارزش Dropbox به بیش از 10 میلیارد دلار رسیده است و این یعنی تازه‌ترین دکاکورن در حال حاضر Dropbox است.</p><p><strong>یونیکورن‌ها دیگر کمیاب نیستند</strong></p><p>تعداد شرکت‌های یونیکورن در جهان به‌سرعت در حال افزایش است. زمانی که آیلین لی اولین بار این اصطلاح را در سال 2013 معرفی کرد، تنها ۳۹ شرکت یونیکورن وجود داشت، اما اکنون تعداد آن‌ها بیش از پنج برابر شده است. رشد استارتاپ‌های یونیکورن از سال 2012 تا سال 2015 دو برابر قبل بوده و این یعنی در آینده شاهد یونیکورن‌های بیشتری هستیم.</p><h1>آیا در ایران استارتاپ یونیکورن وجود دارد؟</h1><p>در اردیبهشت سال 97 مدیرعامل شرکت اسنپ ادعا کرد که ارزش این شرکت بین 1.4 تا 1.7 میلیارد دلار است و این یعنی اسنپ هم تبدیل به یک شرکت یونیکورن شده است اما بعد از افزایش چند برابری نرخ ارز در سالی که گذشت مطمئناً دیگر نمی‌توان اسنپ را جزو شرکت‌های یونیکورن دانست. دیجی کالا هم که عنوان پربازدیدترین سایت فروشگاهی خاورمیانه را یدک می‌کشد تا مرز یونیکورن شدن پیش رفت اما این شرکت هم به دلیل افزایش نرخ ارز از این موضوع فاصله گرفته است. پس&nbsp;جواب سؤال ما تا این تاریخ (تیرماه 98) خیر است و در حال حاضر هیچ شرکت ایرانی را نمی‌توان جزو استارتاپ‌های یونیکورن دانست.</p><h3>ویژگی‌های شرکت‌های یونیکورن</h3><p>تقریباً تمام استارتاپ‌های یونیکورن صنعت را به‌کلی تغییر داده‌اند. اوبر، سفر با تاکسی را تغییر داد، Airbnb بر روی صرفه‌جویی تمرکز کرده است، Snapchat زمینه‌های شبکه‌های اجتماعی را تغییر داد و… .</p><p>بیشتر استارتاپ‌های یونیکورن نه‌تنها بر مزیت اولین بودن (FMA) سرمایه‌گذاری می‌کنند بلکه موقعیت خود را به‌طور دائمی با نوآوری بهبود می‌بخشد. منظور از مزیت اولین بودن این است که یک نوآوری در پشت این استارتاپ‌ها قرارگرفته است و این استارتاپ‌ها درزمینه‌ی کاری خود اولین بوده‌اند. به‌عنوان‌مثال اسنپ اولین استارتاپی بود که تاکسی اینترنتی را به ایران آورد و همین نوآوری بود که این استارتاپ را تا مرز یونیکورن شدن پیش برد. پس اسنپ پاداش اولین بودن را دریافت کرده است. 87٪ محصولات استارتاپ‌های یونیکورن در حوزه‌ی نرم‌افزار، 7٪ سخت‌افزار و 6٪ در حوزه‌ی محصولات و خدمات دیگر فعالیت می‌کنند.</p><p>62٪ از یونیکورن‌ها B2C هستند و مدل‌های کسب‌وکار خود را بر روی ایجاد چیزهای ساده‌تر و مقرون‌به‌صرفه تر برای مصرف‌کنندگان قرار داده‌اند. منظور از B2C ارتباط مستقیم با مصرف‌کننده است. به‌عبارت‌دیگر در بازاریابی از نوع B2C استارتاپ‌ها مستقیماً محصولات یا خدمات خود را به مشتری می‌فروشند. به‌عنوان‌مثال دیجی کالا یک استارتاپ است (البته یونیکورن نیست!) که مستقیماً محصولات خودش را به مشتریان می‌فروشد، پس از B2C استفاده می‌کند.</p><p><strong>آیا اصطلاح یونیکورن محدود به استارتاپ‌های تکنولوژی است؟</strong></p><p>صدها یونیکورن در دنیا وجود دارد که در حوزه‌های تجارت الکترونیک، خرده‌فروشی و صدها حوزه‌ی دیگر فعالیت دارند. باوجود آن‌که بسیاری از آن‌ها استارتاپ‌ها در بخش تکنولوژی فعالیت می‌کنند اما اصطلاح یونیکورن فقط به تکنولوژی محدود نمی‌شود و هر نوع استارتاپی می‌تواند تبدیل به یک یونیکورن شود.</p><p><strong>تفاوت یونیکورن با ناروال (Narwhal)</strong></p><p>ناروال به استارتاپ‌هایی که فقط در کانادا ارزش بالای 1 میلیارد دلار دارند گفته می‌شود اما یونیکورن مربوط به همه‌ی استارتاپ‌های موجود در دنیا است و محدود به کشور خاصی نمی‌شود.</p><p><strong>سخن پایانی</strong></p><p>یونیکورن شدن آرزوی هر استارتاپی است. برخی از استارتاپ‌ها چندین سال تلاش کرده‌اند تا به استارتاپ یونیکورن تبدیل‌شده‌اند. اگر شما هم در فکر یک استارتاپ هستید باید تلاش و پشتکار زیادی داشته باشید تا بتوانید موفق باشید.<br> در این مقاله سعی کردیم استارتاپ‌های یونیکورن را به‌صورت کامل شرح دهیم.اگر شما هم نکات دیگری در مورد استارتاپ یونیکورن دارید لطفاً در بخش دیدگاه‌ها ذکر کنید. </p>',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'وبلاگ',
                    path: '/blog',
                },
                {
                    title: 'استارتاپ یونیکورن چیست؟ | آیا در ایران استارتاپ یونیکورن داریم؟',
                },
            ],
            relatedContents: [{
                    id: 3,
                    title: 'توسعه‌دهندگان چه می‌کنند و چقدر درآمد دارند؟ | Stack Overflow',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/programming-in2019-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 4,
                    title: '۱۰ دلیل برای یاد گرفتن زبان پایتون',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/python-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
                {
                    id: 5,
                    title: 'آموزش گام به گام سی شارپ',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content/uploads/2019/10/csharplearn-min-150x150.png',
                    category: { id: 1, type: 'وبلاگ' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },
    ],
    blogDescription: ' <p class="custom-font-15" style="text-align: justify">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>',
    news: [{
            id: 1,
            image: 'https://demos.mahdisweb.net/digiacademy/wp-content/themes/mweb-digiacademy/assets/images/no-thumb-blog_archive.png',
            icon: 'mdi-file-document-outline',
            title: ' ماهدیس وب در نمایشگاه الکامپ',
            publishedDate: '17 مهر 1399',
            category: { id: 2, type: 'اخبار' },
            description: '<p>در 20 اُمین دوره نمایشگاه بین المللی الکامپ در کنار شما خواهیم بود.سالن 9 غرفه 1</p>',
            subTitle: 'در 20 اُمین دوره نمایشگاه بین المللی الکامپ در کنار شما خواهیم بود.سالن 9 غرفه 1',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'اخبار',
                    path: '/news',
                },
                { title: ' ماهدیس وب در نمایشگاه الکامپ' },
            ],
            relatedContents: [{
                    id: 2,
                    title: 'جدید ترین نسخه افزونه آی کامرس منتشر شد.',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content…-digiacademy/assets/images/no-thumb-thumbnail.png',
                    category: { id: 2, type: 'اخبار' },
                },
                {
                    id: 3,
                    title: 'جشن 3 سالگی ماهدیس وب',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content…-digiacademy/assets/images/no-thumb-thumbnail.png',
                    category: { id: 2, type: 'اخبار' },
                },
                {
                    id: 4,
                    title: 'رونمایی از محصول جدید ماهدیس وب',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content…-digiacademy/assets/images/no-thumb-thumbnail.png',
                    category: { id: 2, type: 'اخبار' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },
        {
            id: 2,
            image: 'https://demos.mahdisweb.net/digiacademy/wp-content/themes/mweb-digiacademy/assets/images/no-thumb-blog_archive.png',
            icon: 'mdi-file-document-outline',
            title: ' جدید ترین نسخه افزونه آی کامرس منتشر شد.',
            publishedDate: '14 مهر 1399',
            category: { id: 2, type: 'اخبار' },
            description: '<p>برای دریافت نسخه جدید افزونه به پنل کاربری خود در سایت ماهدیس وب مراجعه کنید.</p>',
            subTitle: 'برای دریافت نسخه جدید افزونه به پنل کاربری خود در سایت ماهدیس وب مراجعه کنید.',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'اخبار',
                    path: '/news',
                },
                { title: ' جدید ترین نسخه افزونه آی کامرس منتشر شد.' },
            ],
            relatedContents: [{
                    id: 1,
                    title: 'ماهدیس وب در نمایشگاه الکامپ',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content…-digiacademy/assets/images/no-thumb-thumbnail.png',
                    category: { id: 2, type: 'اخبار' },
                },
                {
                    id: 3,
                    title: 'جشن 3 سالگی ماهدیس وب',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content…-digiacademy/assets/images/no-thumb-thumbnail.png',
                    category: { id: 2, type: 'اخبار' },
                },
                {
                    id: 4,
                    title: 'رونمایی از محصول جدید ماهدیس وب',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content…-digiacademy/assets/images/no-thumb-thumbnail.png',
                    category: { id: 2, type: 'اخبار' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },
        {
            id: 3,
            icon: 'mdi-file-document-outline',
            image: 'https://demos.mahdisweb.net/digiacademy/wp-content/themes/mweb-digiacademy/assets/images/no-thumb-blog_archive.png',
            title: '  جشن 3 سالگی ماهدیس وب',
            publishedDate: '20 مهر 1399',
            category: { id: 2, type: 'اخبار' },
            subTitle: 'قول دادیم تا همه پشت هم باشیم و سخت تر از این سه سال برای دست یابی به اهداف ماهدیس و ارائه ی بهترین خدمات به کاربرانمون تلاش کنیم .',
            description: '<p>قول دادیم تا همه پشت هم باشیم و سخت تر از این سه سال برای دست یابی به اهداف ماهدیس و ارائه ی بهترین خدمات به کاربرانمون تلاش کنیم .',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'اخبار',
                    path: '/news',
                },
                { title: 'جشن 3 سالگی ماهدیس وب' },
            ],
            relatedContents: [{
                    id: 1,
                    title: 'ماهدیس وب در نمایشگاه الکامپ',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content…-digiacademy/assets/images/no-thumb-thumbnail.png',
                    category: { id: 2, type: 'اخبار' },
                },
                {
                    id: 2,
                    title: 'جدید ترین نسخه افزونه آی کامرس منتشر شد.',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content…-digiacademy/assets/images/no-thumb-thumbnail.png',
                    category: { id: 2, type: 'اخبار' },
                },
                {
                    id: 4,
                    title: 'رونمایی از محصول جدید ماهدیس وب',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content…-digiacademy/assets/images/no-thumb-thumbnail.png',
                    category: { id: 2, type: 'اخبار' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },
        {
            id: 4,
            image: 'https://demos.mahdisweb.net/digiacademy/wp-content/themes/mweb-digiacademy/assets/images/no-thumb-blog_archive.png',
            icon: 'mdi-file-document-outline',
            title: 'رونمایی از محصول جدید ماهدیس وب',
            publishedDate: '22 مهر 1399',
            category: { id: 2, type: 'اخبار' },
            subTitle: 'پوسته آموزش آنلاین دیجی آکادمی آخرین پروژه گروه طراحی وتوسعه ماهدیس وب می باشد که در پاییز 98 منتشر شد.',
            description: '<p>پوسته آموزش آنلاین دیجی آکادمی آخرین پروژه گروه طراحی وتوسعه ماهدیس وب می باشد که در پاییز 98 منتشر شد.</p>',
            breadcrumbs: [{
                    title: 'صفحه نخست',
                    path: '/',
                },
                {
                    title: 'اخبار',
                    path: '/news',
                },
                { title: 'رونمایی از محصول جدید ماهدیس وب' },
            ],
            relatedContents: [{
                    id: 1,
                    title: 'ماهدیس وب در نمایشگاه الکامپ',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content…-digiacademy/assets/images/no-thumb-thumbnail.png',
                    category: { id: 2, type: 'اخبار' },
                },
                {
                    id: 2,
                    title: 'جدید ترین نسخه افزونه آی کامرس منتشر شد.',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content…-digiacademy/assets/images/no-thumb-thumbnail.png',
                    category: { id: 2, type: 'اخبار' },
                },
                {
                    id: 3,
                    title: 'جشن 3 سالگی ماهدیس وب',
                    image: 'https://demos.mahdisweb.net/digiacademy/wp-content…-digiacademy/assets/images/no-thumb-thumbnail.png',
                    category: { id: 2, type: 'اخبار' },
                },
            ],
            comments: [{
                    fullName: 'کیمیا شیرعلی',
                    publishedDate: '30 مهر 1400',
                    content: 'کسی که به خود اطمینان دارد به تعریف کسی احتیاج ندارد',
                },
                {
                    fullName: 'جواد مرادی',
                    publishedDate: '8 آبان 1400',
                    content: 'اکثرضربه هایمان رااز نمی توانم هایمان خورده ایم',
                },
                {
                    fullName: 'راحله اسماعیلی',
                    publishedDate: '30 مهر 1400',
                    content: 'تجربه بالاترازعلم است.',
                },
            ],
            recentComments: [{
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'محمد دخت هاشم',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'علی نظری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'مینا نادری',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'کیمیا شیرعلی',
                },
                {
                    title: 'در زبان اسمبلی چیست؟ آموزش اسمبلی به زبان ساده',
                    authore: 'امیرعلی شیرعلی',
                },
            ],
        },
    ],
}
mock.onGet('/blog/single').reply((config) => {
    if (Number(config.params.subject) === 1) {
        return [200, data.blogs[config.params.post - 1]]
    } else if (Number(config.params.subject) === 2) {
        return [200, data.news[config.params.post - 1]]
    }
})
mock.onGet('/blog/all').reply((config) => {
    return [200, data.blogs]
})
mock.onGet('/blog/description').reply((config) => {
    return [200, data.blogDescription]
})
mock.onGet('/news').reply((config) => {
    return [200, data.news]
})